[
  {
    "title": "Vacuum Stand for Dyson Multi-Models Storage Bracket Holder with Wheels",
    "price": "€100",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nWide Compatibility: Designed specifically for Dyson vacuums, this stand is compatible with multiple Dyson models (V6, V7, V8, V10, V11, V15, DC30, DC31, DC34, DC35, DC58, DC59, DC62, DC74). It efficiently stores your vacuum and accessories in the kitchen, living room, or garage, freeing up valuable space. Note: Vacuum stand only, charger dock and accessories not included.\n\nSturdy and Long-lasting: This vacuum holder is made with high-strength SPCC cold-rolled steel, and its 4.54 lbs/2.06 kg weighted base ensures stability. Each hook supports up to 11.02 lbs/5 kg, easily holding the vacuum and accessories. The anti-slip pads on the base keep the stand securely in place, avoiding tipping or sliding.\n\nEfficient Storage: This vacuum stand stands at 50 in/1270 mm, with 4 hooks to neatly store your vacuum and accessories, avoiding loss. It saves space, avoids accidental drops and damage, and extends the vacuum's lifespan while keeping your home tidy.\n\nEasy to Move: The stand is equipped with 2 high-durability PA6 casters, 0.75 in/19 mm in diameter, providing smooth movement and strong load-bearing capacity. It can be easily moved to any corner of your home or office and adjusted in tight spaces for flexible operation.\n\nConvenient Installation: Includes tools and instructions for quick assembly in minutes. No drilling required, protecting your walls and allowing flexible placement anywhere, making your home more organized and convenient.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMDI0NDlhNzYwMDUzMWJmMDcyZDkwODhkMDE0ZTRkYzQwNDIzY2RjZmJhNDc0MzA4MTI1YTNmOWIwZDdjYTYxZC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=0bd39d5da024417b58456e3c319131e8caaaeb860f36773d31dca152e16a0339"
    ],
    "url": "https://www.adverts.ie/other-home-garden/vacuum-stand-for-dyson-multi-models-storage-bracket-holder-with-wheels/37449869"
  },
  {
    "title": "65 Pcs Artificial Silk Hydrangea Flowers 9.8 In Bouquet Arrangement White",
    "price": "€100",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nLayered Bloom, Realistic Texture: You’ll receive 65 lifelike artificial hydrangeas, each meticulously handmade with 27 delicate petals for a natural, 3-dimensional blooming effect. These flowers maintain their beautiful, full-bloom appearance for a long time, ideal for creating stunning floral displays\n\nLong-Lasting & Fade-Resistant: Each fake flower is crafted from high-quality silk fabric, ensuring durability and resistance to fading or yellowing. Compared to traditional fresh flowers, these artificial blooms last longer, require no frequent replacement, and can be reused, saving you both time and cost\n\nFlexible DIY Floral Design: The hydrangea artificial flowers measure 9.8\" in total height, with a 7.5\" stem and a 6\" flower head. The generous quantity is ideal for creating various floral arrangements for daily use or special occasions. The stems, made of durable PE-coated wire, can be easily bent or cut to your desired size, offering flexibility for all your creative ideas\n\nMaintenance Made Effortless: These silk flowers require no watering or sunlight, making them ideal for those with little time for upkeep. If the flowers are slightly deformed during shipping, simply adjust them by hand or use a low-heat blow dryer to restore their shape. For daily care, gently wipe away dust with a clean cloth to keep them looking fresh and vibrant with minimal effort\n\nIdeal for Romantic Settings: Our fake hydrangeas are incredibly lifelike, ideal for creating warm and romantic atmospheres. Whether used alone or paired with other flowers, they will be your first choice for weddings, holidays, parties, or home decor. Let your creativity shine by designing bridal bouquets, cake decorations, or gifting a timeless bouquet to your loved ones",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNWViNDM3MzBjNzJiYjZkZWMxNTdmOGIxZTA1OGViZjhjMmExYjk0NWJmMzExNWU3NzVmNGI1ZjU0MDZiZjQ3OS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=c2338e073674e3ae2d0c8b39953212dd153c678359053bc7dcbbbf89003e96e6"
    ],
    "url": "https://www.adverts.ie/other-home-garden/65-pcs-artificial-silk-hydrangea-flowers-9-8-in-bouquet-arrangement-white/37449861"
  },
  {
    "title": "Retractable Side Awning Beige 160x300 cm",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nCreate an instant and private oasis on your balcony, terrace, or patio using this retractable side awning!\n\nWater and UV resistant: This garden privacy screen is made from 100% polyester with a polyurethane (PU) coating, providing good breathability and excellent protection against wind, sun, water, and UV light.\n\nConvenient design: Thanks to its retractable design, the garden screen automatically rolls back when you remove the handle from the post.\n\nEasy installation: The two posts can be easily fixed to the wall and ground for added stability and safety using the included mounting accessories.\n\nWide applications: This versatile side awning can be used in a variety of settings, both outdoors like backyard, terrace, garden, porch, balcony and indoors such as office, clinic, studio, dressing room, to create extra wall space as required.\n\nSpecifications\n\nColour: Beige\n\nFabric material: 100% polyester with a PU coating\n\nFrame material: Steel and aluminium\n\nSize: 160 x 300 cm (H x W)\n\nAssembly required: Yes\n\nMounting accessories included",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiY2U5OWZlOTcyODE0NDU5YTYxYTBjNWYxZTI1Yzc3YzZhMjdhNWI3NTI4N2Y1OWFiNmM0MzdhYWNlYWFkN2M2Yi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=ca0d0f4a3a8d18b4176aec75094c89d20fe8f3d33faa5d0c3f01b50655859246"
    ],
    "url": "https://www.adverts.ie/heavy-machinery/retractable-side-awning-beige-160x300-cm/37449858"
  },
  {
    "title": "356x508 mm BBQ Island Access Door Outdoor Kitchen Door Stainless Steel",
    "price": "€185",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nPrecision Opening: Overall dimensions: 356x508x46 mm / 14x20x2 inches, installation size: 11x17inch/271x423mm, it is recommended to reserve an additional 0.08inch/2mm on this basis for better operation. The door is designed specifically for outdoor kitchens and barbecue islands, adding an elegant touch to your cooking area. With precise dimensions, it is easy to process, install, or dismantle. Available in various sizes and styles, it is perfect for indoor/outdoor kitchens and all other outdoor weather conditions.\n\nHigh-quality Materials: This access door is made of sturdy high-quality stainless steel, rust-proof and waterproof. You can clean it well without leaving any traces. The integrated thickened frame structure is durable, with a fully seamless design, no sharp corners. The unique U-shaped panel structure provides better strength and durability. Magnets at the top and bottom keep the cabinet tightly closed, effectively preventing insects from accessing your food or anything inside the cabinet.\n\nLeft & Right Door Reversible Design: Adopting an L-shaped insert quick disassembly structure, the hinge can be removed for door direction adjustment. Doors open without blocking walls or hitting doors, eliminating the annoyance of left or right door openings, allowing you to adjust the direction according to your usage habits, making replacement convenient.\n\nHumanized Design: Delicate zinc alloy handles conforming to ergonomics, enlarged size for easy opening. The door frame edges are bent and thickened for safer use, providing a more user-friendly experience, allowing you to enjoy cooking in your outdoor kitchen without worries. It also equipped with louvred vents, allowing better air circulation in the storage compartment.\n\nEasy to Install: The external packaging prints a 1:1 installation perforated CAD drawing. You can follow the instructions to place the template where the bbq door needs to be installed and perforate according to the line drawing. It can be easily installed on any wall in minutes using embedded installation",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzU1MWNlNTllNTBmY2NmZTNmOGU2NzlkYTNiMTlmODUxMzY1ZDg3NmNjN2QzYWI2NDExZDZmOTQzYWI2NmZkYi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=bf575a6e90443984f3211acf3298f955e61b4bc699fe622e699fede66d8119dc"
    ],
    "url": "https://www.adverts.ie/other-home-garden/356x508-mm-bbq-island-access-door-outdoor-kitchen-door-stainless-steel/37449812"
  },
  {
    "title": "Manual Meat Grinder, 304 Stainless Steel Hand Meat Grinder with Suction Cup + Steel Table Clamp, Meat Mincer Sausage Maker & 2 Cutting Plates",
    "price": "€225",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nOne Meat Grinder, Endless Uses: VEVOR multifunctional manual meat grinder allows for easy vegetables and meat grinding to make meatballs, cookies, sausages, and more. It also comes with 5mm and 8mm cutting plates, 1 cutting cross blade, 1 stainless steel sausage tube, 1 cookie attachment, 1 grinding head and meat pusher rod, catering to the diverse needs of different culinary creations.\n\nDual Secure Fixation Methods: This hand-operated meat grinder incorporates two reliable fixation methods: bottom strong suction cup and 304 stainless steel table clamp. Dual secure fixations make the machine remains steady and firmly in place, eliminating any concerns of shaking or falling during use. The opening range of steel clip is 0.79\"-1.97\" (20-50 mm), accommodating a majority of tabletops with most thicknesses.\n\nVersatile Ingredient Processing: Our hand crank meat grinder can grind various meat ingredients such as beef, pork, fish, and chicken racks, and it can also grind vegetables with low moisture like mushrooms and peppers. #8 caliber simulates the manual process of meat mincing, which greatly retains the original taste, keeps the meat fresh, and 100% locks the texture and nutrition of the meat.\n\nFood-Grade 304 Stainless Steel: All parts of our heavy-duty meat mincer are made of food-grade stainless steel in one piece casting, with excellent rust resistance, corrosion resistance, and ease of cleaning. The fine mirror polishing process makes the body and the internal parts are more perfect. You don’t have to worry about the metal shavings falling off and cause waste of expensive ingredients.\n\nEasy Installation and Cleaning: The manual sausage maker can be easily disassembled, allowing for quick and thorough cleaning of each component with our provided cleaning brush. Simply follow the sequential assembly, and you'll have the machine ready to use. Ergonomic handle reduces hands fatigue and maximizes grinding productivity.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYTU0ZmYyYzE5MTNkNzViYWEwZDE2NTQ3OTg4OTRhNmZlZjI2YjBlMTE0OWYxN2NlZWFhZTNmYjkwODcxNGM2YS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=c0ad2f1a9a7012ebf76672b6c91fc08a9050935c9d20f29a75c5ed3c1dd09c7d"
    ],
    "url": "https://www.adverts.ie/home-storage/manual-meat-grinder-304-stainless-steel-hand-meat-grinder-with-suction-cup-steel-table-clamp-meat-mincer-sausage-maker-2-cutting-plates/37449809"
  },
  {
    "title": "Pallet Forks, 2000 lbs Tractor Bucket Forks, 60\" Total Length Clamp on Pallet Forks with Adjustable Stabilizer bar, Heavy Duty Pallet Forks",
    "price": "€485",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\n2000 LBS Capacity: Made from durable square steel tubing, these pallet forks can easily handle your everyday needs without bending or breaking under pressure.\n\nReinforced Bolts & Screws: With reinforced bolts and grooved screw heads, our clamp on pallet fork is built to last.\n\nAdjustable Stabilizer Bar: The stabilizer bar can be adjusted between 19.5\" and 36”. You'll never have to worry about heavy loads causing your forks to separate. Stay safe while getting your farming and gardening tasks done.\n\nEasy Installation & Versatile: Our tractor fork is designed to handle a variety of tasks. Simply slide the fork over the cutting edge of your bucket and clamp it down to lock it in place. You can use it to move logs, wood, and firewood, transport fence posts and hay bales, clear debris and bushes, and more.\n\nProduct Dimensions: This pallet fork for tractor and bucket measures 60\" overall length, with a 43\" fork blade. The blade has a height of 2\" and a width of 2.75\". The gap between the lip of the bucket and the blade is 2.95\". The adjustable range of the stabilizer bar is 19.5\" to 36 \"W. Each package contains 1 x fork, 1 x stabilizer bar, and 1 x user manual.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOGUwODJlYzkzN2MzNzYwMzY5MDg3Y2M0MjdhNTczOTU2OTFhNTlhYWJiYTBlMGQ4OTEzNDhkMDVlNDM0NzY0Yy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=a3894da1e254b61d975483335a826c00f7ee98d248ac095b2513c67b5d6f661f"
    ],
    "url": "https://www.adverts.ie/heavy-machinery/pallet-forks-2000-lbs-tractor-bucket-forks-60-total-length-clamp-on-pallet-forks-with-adjustable-stabilizer-bar-heavy-duty-pallet-forks/37449793"
  },
  {
    "title": "Drywall Rolling Lifter Panel, 11ft Sheetrock Lift Drywall Lift, 150lb Weight Capacity Panel Hoist Jack Tool",
    "price": "€600",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\n150 lbs Load Capacity: This drywall lift is made of heavy-duty carbon steel, ensuring its longevity and durability. With a maximum load of 150 pounds, this drywall rolling lifter panel is ideal for home and commercial use.\n\nAdjustable Height & Length: The telescopic arm can be adjusted from 4 to 9.5 ft, perfect for installing sheets. And the sheetrock lift drywall lift can reach a height of 11 ft that can help you attach to the ceiling.\n\n60° Tiltable Rotation Panel: Our drywall lift panel hoist can tilt 60° forward or backward and rotate 360 degrees. Thus, it is widely used in flat and inclined ceilings.\n\nSecure & Good Balance: The cradle of the drywall hoist features locking outriggers. The entire unit is supported by a broad tripod base with 3 anti-slip locking casters for secure mounting. Thus, it is flexibly moving but stable enough.\n\nEasy Assemble & Operation: The drywall panel lift hoist is easy to assemble and disassemble without tools. The hoist jack lifter features labor-saving with a winch. It is perfect for DIY and residential use, allowing one person working alone to install plasterboard or plank.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOTRjNGNmMTdmYzAxYWVkYzJiY2E1NTMyZDc2MDdmMzM0Y2YwNjRmMTQ5YTUyZTYxZmE3ZWM2ZDk4ZTRmOTAzNi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=531520d86c131048f7da6852e433dbd1d0afd1bdd74466651b7de1645963602e"
    ],
    "url": "https://www.adverts.ie/industrial-equipment/drywall-rolling-lifter-panel-11ft-sheetrock-lift-drywall-lift-150lb-weight-capacity-panel-hoist-jack-tool/37449792"
  },
  {
    "title": "31.5 in Round Dining Table Wood Kitchen Table for 2-4 Person (Only Table",
    "price": "€400",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nHigh-Quality Materials: The tabletop is made of a combination of MDF and laminate finish, which not only gives it an elegant and aesthetic appearance but also provides outstanding functional features. MDF offers a solid, smooth surface base, while the laminate finish enhances the table's resistance to wear, scratches, and stains, effectively protecting our wood dining table from minor scratches and spills\n\nSturdy and Durable:The kitchen dining room table features a 0.6 in thickened tabletop, paired with a sturdy metal base design that not only provides exceptional stability but can also easily support up to 250lbs. The thickened tabletop enhances the structural strength and overall durability, while the metal base provides unmatched stability\n\nSpacious Dining Table:This round dining table has a tabletop diameter of 31.5\", with a compact yet elegant design that comfortably seats 2-4 people, making it an ideal choice for smaller spaces. Its spacious surface offers ample working space within limited space, providing convenience and comfort for dining, working, reading, or casual conversations\n\nWide Application:This leisure table is suited for a variety of settings and meets different usage needs. Whether it's for a family afternoon tea, a gathering with friends, daily work, or casual gaming, it offers the ideal solution, making it a practical choice for homes, offices, cafés, and more\n\nEasy to Assemble: Our kitchen table is equipped with a detailed instruction manual and a full set of high-quality screws and hardware, ensuring a quick and easy assembly process. Whether you're a DIY novice or an experienced worker, you'll be able to assemble the table in no time and start using it immediately, saving both time and effort",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOTk2YWJiZTdiNzA2ZGFjY2FlMTRhZTNiNTJhZWI2M2NjNjM4NjdlYTJhNjU5ZjA1NDJlNzVhZmIzM2QyMjEwNS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=0d8a8065d18830cbe904e135ff03d39b81cbd069be85ce5cdc50a2b8f8d3c513"
    ],
    "url": "https://www.adverts.ie/dining-tables-chairs/31-5-in-round-dining-table-wood-kitchen-table-for-2-4-person-only-table/37449789"
  },
  {
    "title": "Meat Slicer, 180W Electric Deli Food Slicer with 7.5\" SUS420 Stainless Steel Blade and Blade Guard, 0 - 0.6 inch Adjustable",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nUpgraded SUS420 Blade: Our meat slicer is equipped with an upgraded 7.5\" wide SUS420 stainless steel blade, effortlessly handling various food textures such as frozen meat, cheese, raw meat, cooked meat, ham, and bread.\n\nQuick Slicing: Powered by a 180W motor running at 80-120 rpm, coupled with sharp blades, our electric food slicer allows you to quickly slice through a variety of ingredients, significantly enhancing your work efficiency.\n\nAdjustable Thickness: The deli meat slicer features a thickness adjustment knob with a range from 0-15mm (0 - 0.6 inches). You can easily customize the thickness to meet your preparation needs, perfect for making hamburgers, sandwiches, cold cuts, fruit platters, and more.\n\nEasy to Clean: All parts of the electric meat slicer in contact with food are made of food-grade materials. The stainless steel tray can be easily cleaned with a cloth after slicing, and the blades, food holder, and food pusher are removable, ensuring thorough cleaning and hygiene for your subsequent slicing tasks.\n\nStability and Safety: Our frozen meat slicer includes a raised food pusher with protruding spikes and non-slip feet, ensuring stable and smooth meat slicing. The food pusher effectively protects your safety while working.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNWUwNWE4NTRmOTQ4MzFiMWEzMzY1ZjA5Y2I4MzhhM2JjN2VmMDQzMzUzMjg3MmRiZTA5NmZkMTU5OWM0MzRkZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=122806ed0bbcc298c7832811986d16e90159f9288b39620089068c149f704491"
    ],
    "url": "https://www.adverts.ie/other-home-garden/meat-slicer-180w-electric-deli-food-slicer-with-7-5-sus420-stainless-steel-blade-and-blade-guard-0-0-6-inch-adjustable/37449786"
  },
  {
    "title": "Metal Raised Garden Bed 6x3x1.5ft Outdoor Galvanized Planter Box Dark Gray",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nCreate a Stunning Garden: Our 6 x 3 x 1.5 ft raised garden bed provides ample growing space for your plants. With a depth of 1.5 feet, it's perfect for medium and deep-rooted plants and vegetables to establish strong roots. Grow a variety of vegetables, fruits, flowers, and herbs in your garden, farm, field, or open area, and transform your space into a beautiful garden.\n\nSturdy and Durable: This metal raised garden bed is constructed with 0.4mm thick metal side panels and 0.6mm thick metal corner connector panels. The surface is coated with galvanized powder for rust and corrosion resistance, ensuring long-term use in outdoor environments. The 4 internal X-shaped reinforcement bars provide extra stability, preventing the bed from toppling in strong winds. Get ready to tackle the outdoors with confidence!\n\nSecure to Use: To ensure your safety during use, our raised planter box features rolled edges with edge protectors to prevent hand injuries or scratches. Use with peace of mind and enjoy gardening effortlessly.\n\nEasy Installation: Equipped with complete screws and a pre-drilled design, you can quickly and easily assemble the raised bed by following the instruction manual. It only takes 15 minutes to set up with no extra tools required, making it perfect for gardening enthusiasts of all levels, including beginners.\n\nWhat You'll Get: Our raised garden bed includes 6 side panels, 4 corner panels, 4 cross bars, 2 edge protection strips, 4 plastic end caps, 61 galvanized screws, and a user manual.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZTEzMzA3OTM3MmEyZjM0NTcwMmY0OGNlNzRiNDIxMTQ2NDNhZWU0YjczY2U3MjgwMTE2YWE5ZWZlYzQ4MTYxYy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=23a59ead762de81378f8e4cfa3325f0c105ce97f83c35e29bf0d99cc9f66126d"
    ],
    "url": "https://www.adverts.ie/other-home-garden/metal-raised-garden-bed-6x3x1-5ft-outdoor-galvanized-planter-box-dark-gray/37449782"
  },
  {
    "title": "Bed Frame without Mattress Dark Grey Fabric 135x190 cm Double",
    "price": "€275",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nThis classic bed frame will become the focal point of your bedroom.\n\nDistinguished by an understated yet elegant design, this bed frame adds a touch of elegant charm to your bedroom decor. Made of wood and iron, this bed frame is exceedingly sturdy and durable. The wooden legs add extra durability to the bed. Additionally, upholstered in durable fabric, the bed exudes an inviting look, and it is easy to clean. This bed frame is suitable for a mattress of 135 x 190 cm.\n\nPlease note that delivery includes a bed frame only; a mattress is not included. The bed is easy to assemble. You can check our shop for the matching mattresses.\n\nPros and cons\n\nplus_fill\n\nThe fabric gives your bedroom a soft look\n\nplus_fill\n\nThis bed fits perfectly in a modern bedroom\n\nminus_fill\n\nDon't place the bed in direct sunlight to prevent discoloration\n\nSpecifications\n\nColour: Dark Grey\n\nMaterial: Iron frame + solid wood legs\n\nHead board material: MDF + fabric\n\nOverall dimensions: 198 x 141 x 81 cm (L x W x H)\n\nSuitable mattress size: 135 x 190 (W x L) (mattress not included)\n\nSleeping height from the ground: 22.5 cm\n\nFabric: Polyester: 100%",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNjRjNThhNjRlNjM4ZThkMDJlNTVmYTk2ZWJiMjljY2RlNTViNjhkZmE2NzIxMmEyZmM4OWI5ZDY1MjI2NDYzNy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=25c0b1cc07fcfd5cb563b887f69030376d88b59ac18f8b77e674568661ea6b72"
    ],
    "url": "https://www.adverts.ie/double/bed-frame-without-mattress-dark-grey-fabric-135x190-cm-double/37449762"
  },
  {
    "title": "Manual Retractable Awning with LED 100 cm Cream",
    "price": "€225",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nThis retractable awning will be ideal for use in front of the window, on the terrace, balcony or in your garden.\n\nThis water- and dirt-repellent and UV- and weather-resistant awning is made of quality polyester with a PU coating. The strong steel frame makes the awning sturdy and durable. The easy-to-clean polyester canopy can be removed and washed. Thanks to the handle crank, this awning is retractable. The height and the angle of the awning can also be adjusted. In addition, those solar-powered LED lights provide lighting at night. The awning is easy to assemble.\n\nThis awning is a perfect choice for your outdoor living space and can easily be operated manually.\n\nSpecifications\n\nColour: Cream\n\nMaterial: Fabric (100% polyester) with PU coating, steel\n\nWidth: 100 cm\n\nMaximum projection: 120 cm\n\nFlexible installation height: 200-300 cm\n\nSupport bar diameter: 15 mm\n\nLength of crank handle: 125 cm\n\nManually operated\n\nWater and dirt repellent\n\nIncludes solar panel and LED strip\n\nAssembly required: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYjE2NjQyM2E1ODU5YWU1YmQyYTBjNmJiMWNjNjc4NDMyYWU3ODViY2FiODg3NmYxZTdhNWY4Yzc3NjBhYTNkZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=fc722fbd41068c69dc6ae411eb041a0aca6229546c6735b80c93f41c61def7d8"
    ],
    "url": "https://www.adverts.ie/other-home-garden/manual-retractable-awning-with-led-100-cm-cream/37449756"
  },
  {
    "title": "Free Standing Awning Blue and White 400x300 cm Fabric and Steel",
    "price": "€600",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nEnjoy a cool drink, a tasty treat, or a good conversation on your patio with friends while lounging underneath this free standing awning!\n\nDurable material: The patio awning frame is made of steel, which is robust and durable. The fabric with PU surface treatment is UV resistant. It will protect your family or guests from UV rays and dazzling sunlight.\n\nRetractable function: Thanks to the handle crank, the window awning is retractable to meet your different requirements. It provides cooling shade when stretching and does not block the view when contracted.\n\nWide applications: This retractable awning features a simple, stylish design that will blend well with your home or commercial settings. It is suitable for a variety of places, such as balconies, patios, yards, restaurants, cafes, shops, and more.\n\nSpecifications\n\nFabric colour: Blue and white\n\nFrame colour: Anthracite\n\nMaterial: Fabric (180 g/m² polyester) with PU coating, steel\n\nOverall dimensions: 400 x 300 x 260 cm (L x W x H)\n\nAssembly required: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMjMxMTQwY2E5ZTA5NmIyZmNjZThlZGM0OWQ2MDFhYTllMzRlYWFhMjYyYjk1NDc4ZTAyNjEzNjQwYjIxODU5NC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=071c4ed315cb6409411e9d7ecb091ea2d86f24d19da1330d971f612f847210db"
    ],
    "url": "https://www.adverts.ie/other-home-garden/free-standing-awning-blue-and-white-400x300-cm-fabric-and-steel/37449752"
  },
  {
    "title": "Single Mattress 7-Zone Hybrid Pocket Spring Medium-Firm Bed Mattress | Pressure Relief Technology & Cooling Gel Memory Foam(90x190x22cm)",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nSize\n\nSingle (90×190×22CM)\n\nProduct dimensions\n\n190L x 90W x 22Th centimetres\n\nItem firmness description\n\nMedium Firm\n\nTop style\n\nTight Top\n\nCover material\n\nPolyester\n\nRevolutionary Spring Technology: Engineered for perfect balance, it adapts to your body shape, ensuring a customized sleeping experience that relieves pressure points and enhances comfort throughout the night\n\nMulti-Layered Hybrid Innovation: The memory foam contours to your body, relieving pressure, while the springs provide sturdy support, together promoting healthy spinal alignment and motion isolation, undisturbed sleep\n\nBreathable Materials: Crafted with breathable foam layers cover, our mattress creates a fresh sleep environment. The breathable design prevents heat build up, ensuring cool and comfortable",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMGUxNzBkNzVkZmJiMTE3OWQwZjM0ZWYzZTQ1NThlYTAwZjA5MjhmZDA5ODIxNzhmMTQwOGY0MTllMjAyNzQ2NC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6MjkyfX19?signature=eb630a2e23bb1a0cd448037155f2d2b250146b33e03e4a89a07dfbbd055da566"
    ],
    "url": "https://www.adverts.ie/other-home-garden/single-mattress-7-zone-hybrid-pocket-spring-medium-firm-bed-mattress-pressure-relief-technology-cooling-gel-memory-foam-90x190x22cm/37449633"
  },
  {
    "title": "2400W Electric Chainsaw, One-Step Tool-Free Tensioning, 16 Inch Oregon Bar and Chain, 15m/s Chain Speed, 6m Power Cable",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nPower source\n\nCorded Electric\n\nHorsepower\n\n2400 Watts\n\nItem weight\n\n4.65 Kilograms\n\nProduct dimensions\n\n21.5L x 25W x 43H centimetres\n\nChain length\n\n16 inches\n\nOne-Step Tool-Free Tensioning: The chainsaw features the SDS system, allowing you to easily adjust chain tension without tools, eliminating the hassle of chain adjustments. Simply turn the SDS knob to its tightest position without the need for complicated adjustments, and you can start using electric chainsaw.\n\nHigh-Quality Components: The 16 inches oregon bar and chain are dependable. The electric chainsaw is equipped with two chains for replacement. While the 6m power cable extends your working range. Be ready for your woodworking projects with our reliable equipment.\n\nPowerful Performance: The electric chainsaw is equipped with a 2400W pure copper motor. The chain speed reaches 15 m/s, and the cutting thickness is up to 385 mm. It can be used for felling trees and sawing lumber. Note: Please ensure the circuit current is above 15A.\n\nMultiple Safety Protections: The machine's chain brake system prevents injuries caused by accidental machine start-ups. With a 0.12-second braking time, your safety is maximized, and the steel bumper spikes enhance cutting stability.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNWIwMzI4YzM3NzZmM2U5M2Y5ZDhiZGQwN2RjZjBmMjgzZTZiNTI3Y2I3MjdjYzRhMzQwMmNiYTkxNTdmZDRhYS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6MTk0fX19?signature=2bcd191ab0386d93db2457c6d6c1f2f09d988a0051e311725d887a928e8925a3"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/2400w-electric-chainsaw-one-step-tool-free-tensioning-16-inch-oregon-bar-and-chain-15m-s-chain-speed-6m-power-cable/37449612"
  },
  {
    "title": "Cordless Strimmer Adjustable Garden Strimmer 2 -4000 mAh Battery Strimmer Brush Cutter With 25 Blades Electric Strimmer Grass Trimmers For Garden Clearing",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nPower source\n\nBattery Powered\n\nColour\n\nRed\n\nItem weight\n\n3.5 Kilograms\n\nCutting width\n\n6 inches\n\nProduct dimensions\n\n94L x 17.8W centimetres\n\n【3 In 1 Garden Strimmer Cordless】: 3-In-1 Grass Strimmer/Edge Trimmer/Brush cutter, Features low noise, waterproof and easy to clean, very suitable for lawn trimming, weed removal, gardening pruning, etc. Strimmer cordless with 800W high power pure copper motor, 18000 rpm no-load speed(6000 rpm work speed), with a superior run- time to ensure smooth mowing, allowing you to easily complete the garden lawn weeding work.\n\n【2 pcs 4.0Ah Larger Batteries】: The cordless strimmer with battery and charger is equipped with two 4000mAh high-capacity lithium batteries (most conventional batteries on the market are 2.0Ah), but this machine's one 4.0Ah battery is equivalent to two 2.0Ah batteries; this means you can effortlessly handle a larger yard without worrying about running out of power. Please fully charge the battery before using the strimmer for the first time.\n\n【Multi-Function Brush Cutter Blades】: The strimmer cordless has three blades that can easily cope with various situations. ① The plastic blade acts like a heavy-duty rope and is ideal for soft grass; ② The metal blade is great for trimming weeds, reeds, etc.; ③ The manganese steel circular saw blade is used to cut small shrubs and branches. The garden strimmer plastic blade is suitable for trimming young grass. If your garden grass is thicker, you can simply use the metal blade",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOWM0NTBhYTYwMGUxODE0OWE1MTQ1OTE4ZjMxMDYzNzE0NDg5OWE2MzUwZDQ5YzRmMThkNjc5NzJmZDNmYjQ3ZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6MjkyfX19?signature=7cef0ba2b9d8e1ef1fea8f1905b7e4e563339aa680f23f608cf901206bc812ff"
    ],
    "url": "https://www.adverts.ie/power-tools/cordless-strimmer-adjustable-garden-strimmer-2-4000-mah-battery-strimmer-brush-cutter-with-25-blades-electric-strimmer-grass-trimmers-for-garden-clearing/37449605"
  },
  {
    "title": "Back Massager with Heat -Deep Tissue Kneading Massage Chair, Massage Chair for Full Back, Chair Massager for Home or Office Chair use,Gifts for Women,Men",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nUse for\n\nWhole Body\n\nPower source\n\nCorded Electric\n\nMaterial\n\nAlloy Steel\n\nItem weight\n\n3145 Grams\n\nBrand\n\nCOMFIER\n\nColour\n\nBlack Blue\n\nAdjustable Deep Kneading Massage: The back massager features Shiatsu rollers with 4 rotating nodes that can move up and down, mimic the massage hands, perform deep tissue massage on knots and muscles which brings relaxation throughout the body. ( 2 adjustable intensity levels for options)\n\nCustomize Zone Massage: The shiatsu back massager allows you to customize the zone and enjoy a relaxing massage as you wish. You can choose to focus the kneading massage on certain zone of your back, including Full back, Upper back and Lower Back. Also you can use SPOT massage feature to concentrate your massage on a specific area on your back for pin-point relaxation\n\nSoothing Heat Therapy: The Shiatsu back massage chair features heating function. The optional heating comes from heating areas that provide soothing warmth while the shiatsu balls go across your entire back\n\nPortable Chair Massager: The integrated strapping system secures the massage chair to almost any of the chairs. You can place this massage device on a recliner, sofa, couch, office chair to enjoy a therapeutic massage in the comfort of your home or office. This back massage cushion will be a perfect gift for your loved ones",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNjk3NWE1NzhhOGE1NDhhY2I2NzAwMDI2NzI3ZGEwNWRkNWI3OTIyMzdmMjRjNWJiY2ZhZjdkMGE4MzJmZjhmNi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyMTIsImhlaWdodCI6MjkyfX19?signature=4b02d8417aabf837a76186373cb543d6589746e79943920b58b00c30eaf04a62"
    ],
    "url": "https://www.adverts.ie/other-home-garden/back-massager-with-heat-deep-tissue-kneading-massage-chair-massage-chair-for-full-back-chair-massager-for-home-or-office-chair-use-gifts-for-women-men/37449597"
  },
  {
    "title": "Wooden Base Floor TV Stand with mount for 32-75 Inch LED OLED LCD Plasma Flat Curved Screens, Height Adjustable with 3-Tier Shelves,",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nTop highlights\n\nMounting type\n\nFloor Mount\n\nMovement type\n\nSwivel\n\nBrand\n\nRFIVER\n\nMaterial\n\nWood\n\nMaximum Compatible Size\n\n75 Inches\n\nColour\n\nWhite\n\nCompatibility：Suitable for TV screen size from 32 to 75 inches with a maximum load capacity of 50 kg (110 lbs); Compliant to VESA patterns 100x100/200x100/200x200/300x200/300x300/400x200/400x300/400x400/600x200/600x400mm\n\nHeight Adjustable & Smooth Swivel Mount：You have a couple of ways to adjust the tv floor stand height from 1065.5mm to 1215.5mm depending on your TV's mount points. Mount bracket swivels left and right 30 degrees to provide a wide-range viewing angle.\n\nWood-Textured Base：Don’t hesitate to have this tall TV stand with mount, there’s no need to drill your beautiful wall but decoration for your room.Sturdy Wood Base make you NO WORRY about breakage during the transportation and installation. Dimensions are 650 x 400 mm.\n\nCable Management System：The integrated cable management is very effective in concealing the cables, easily route cables through the central support pole keeping your equipment and accessories neat and organized; anti-slip rubber feet ensure stability and protect the floor from scratches",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYjgzNjExNGFiZGVhZDBhOWNmZDQ4NWRjZTIwOWM5MmY5OGQ5MjhhN2ZjZTcwNDMzYjcyNDI2MjcyMjkyYjQxOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoxOTQsImhlaWdodCI6MjkyfX19?signature=7fc2f70cdd5a1c3b6fd3bf59c11346391d6d933b42f21d2de287ca3ef7276ce9"
    ],
    "url": "https://www.adverts.ie/other-home-garden/wooden-base-floor-tv-stand-with-mount-for-32-75-inch-led-oled-lcd-plasma-flat-curved-screens-height-adjustable-with-3-tier-shelves/37449592"
  },
  {
    "title": "Electric Air Pump with 3 Nozzles/Inflate Or Deflate Swimming Ring, Airbeds, Paddling Pools & Other Toys / AC110-240V/ DC12V/50W",
    "price": "€50",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nColour\n\nBlack\n\nBrand\n\nK-MART\n\nMaterial\n\nPlastic\n\nItem weight\n\n360 Grams\n\nProduct dimensions\n\n11.6L x 11.7W x 13.9H centimetres\n\nPower source\n\nCorded Electric\n\nELECTRIC AIR PUMP 2-IN-1: This electric pump is engineered for quick inflation and deflation, this pump works faster than hand pumps, saving you time when inflating or deflating various items.\n\nINCLUDES 3 NOZZLES: This electric pump for inflatables comes with three different nozzles that easily attach to fit all standard valves, perfect for air mattresses, pool floats, inflatable pools, rafts, sofas, water beds, boats, pool toys, swimming rings and more.\n\nQUICK FILL: Our air pump for inflatables comes with the best feature. Quick fill & low pressure electric inflatable pump car power adapter 2m/110-240V and home plug 5.58ft cable/12V/50W home power adapter are included, you can use it anywhere.\n\nPORTABLE & LIGHTWEIGHT: This portable inflator pump is small and lightweight, making it effortless to carry anywhere. It's portability allows for convenient indoor and outdoor use. Ideal for camping or travel, it’s designed for effortless portability wherever you go.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOTI5NDI2Mzg3Y2Y2NzM2OTNlNWZiZmU2YjUyOTk5OGQ3MDc2YTI2ZThmZGJkZWNmNWE2MzU0NDhlYjM5NTA0Ni5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyNzgsImhlaWdodCI6MjkyfX19?signature=9f63f4737eaeabb5108c26a82fc01f1961194d4915947af4e00d73c4a3518cd3"
    ],
    "url": "https://www.adverts.ie/other-home-garden/electric-air-pump-with-3-nozzles-inflate-or-deflate-swimming-ring-airbeds-paddling-pools-other-toys-ac110-240v-dc12v-50w/37449590"
  },
  {
    "title": "6-Panel Room Divider Anthracite 520x180 cm Fabric",
    "price": "€285",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nDescription\n\nThis room divider can divide a room into several parts to provide a private space and protect your privacy.\n\nDurable material: The fabric features a simple and clean look, and is breathable and durable.\n\nVersatile function: You can not only use the room divider screen to separate the bedroom, or block part of the room as needed, and also place it on the side of the window to block direct sunlight. Of course, you can even use the screen as a background wall.\n\nFoldable design: This 6 panels room partition is foldable, so it's easy to store without taking up much space.\n\nGood to know:\n\nEach product comes with an assembly manual in the box for easy assembly.\n\nThis room divider fabric allows some light to filter through, so it doesn't completely block all the light.\n\nSpecifications\n\nColour: Anthracite\n\nMaterial: Fabric (100% polyester), iron\n\nOverall size: 520 x 180 cm (W x H)\n\nEach panel size: 83 x 161 cm (W x H)\n\nFoldable",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYmMwYzg0NTY3NDdjNTg1Nzk0ZDVkMDg0MTg0NmJlNzRjMjY1NDgwNDk0NjhlNzA1YzE4ZjhjMjcwYzQzMzRlMi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=9e4319d7c1f4f7d90039f52a1bff5c16048e7a24b17577d9fe4b19c3a4d8f479"
    ],
    "url": "https://www.adverts.ie/armchairs/6-panel-room-divider-anthracite-520x180-cm-fabric/37449588"
  },
  {
    "title": "Electric Air Pump for Inflatable Pool Toys - High Power Quick-Fill Air Mattress Inflator Deflator Pump for Pool Float Raft Gymnastics Track Mat, Portable Air Pump 4 Nozzles AC 220-240V (",
    "price": "€85",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nColour\n\nBlack\n\nBrand\n\nMAACLOUD\n\nMaterial\n\nPlastic\n\nItem weight\n\n400 Grams\n\nProduct dimensions\n\n18L x 8W x 12H centimetres\n\nPower source\n\nCorded Electric\n\nElectric Air Pump: Inflatable pump is perfect for indoor use with 220V AC, cord length of 1.58M, air pressure is 2.5psi/17000pa. You can inflate a XXXL air mattress within a few minutes, which saves much more time than using old rechargeable or battery air pump\n\nAirbed Pump Wide range of uses: The high-power electric air pump can be used for inflating large air mattresses, pool float, inflatable beds, boats, rafts, sofas, bathtubs, waterbeds, floaty, swimming rings. This machine is also suitable for household vacuum compression bags\n\nSafe and Durable: MAACLOUD air pump for inflatables is designed with safety in mind, using heat-resistant charging cables and high-quality metal impellers for lower noise, better safety performance, fast heat dissipation, and long service life\n\nPORTABLE EXTENSION HOSE: The retractable hose ranges from 12.6 to 39.4 inches, allowing flexible use in awkward angles, AC 220-240V Quick-Fill Inflator, Air Pump for Gymnastics Flooring Enabling Yoga Taekwondo Exercise Gym Fitness Tumbling Mat",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMGIyZTEyYTVmNWZlZjFjM2JkMDRkZDczMjk4NTA3OTZlMzVhZjE2MzU0MjA1Zjk2OTk4OTMzNjQ3MWU0MWEwNy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6MjkyfX19?signature=c026a4f5c78e72b486c721e952183c48621ecb1d9dde03c431a1a247a1640276"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/electric-air-pump-for-inflatable-pool-toys-high-power-quick-fill-air-mattress-inflator-deflator-pump-for-pool-float-raft-gymnastics-track-mat-portable-air-pump-4-nozzles-ac-220-240v/37379849"
  },
  {
    "title": "Kitchen Island Cart Rolling Storage Cabinet on Wheel with Drawer & Shelves",
    "price": "€750",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nPremium Quality: The mobile kitchen island features a top made of high-quality solid rubberwood and MDF material, making the surface stain-resistant, waterproof, sturdy, and durable.\n\nConvenient Storage: This portable kitchen island provides extra convenient storage space for your kitchen with 2 drawers, 4 cabinet doors, and 2 adjustable shelves, offering ample space for your items. The towel rack and spice rack provide additional storage options, keeping your items organized and your kitchen and dining room clean and tidy.\n\nFlexible Mobility: The rolling kitchen island is equipped with four flexible casters, two of which can be locked to ensure high stability when stationary. You can easily move the kitchen cart, and the towel rack can serve as a handle to help you move it effortlessly.\n\nExquisite Details: Features built-in adjustable shelves (up and down to 64mm) and upgraded drawer bottoms with a thickness of 5mm for more stable weight bearing. The metal drawer slides and golden handles enhance the user experience.\n\nFoldable Drop Leaf: When the drop leaf is extended, you can enjoy dinner on the table. Easy to install with ample accessories and an installation video for reference.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzY5NjgyYzkwNTE2ZWQyOTczOThjOGQ5NTRjZjdhYjM3MDg2NWVmNjIxNDRmMTRhNDhkYjRjMTM3YmQzNjNlYi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=a0932cef86bfc44cb3ab26f45affe78d92ba3a49b691949464f564e77f862f09"
    ],
    "url": "https://www.adverts.ie/cabinets/kitchen-island-cart-rolling-storage-cabinet-on-wheel-with-drawer-shelves/37379923"
  },
  {
    "title": "9 x 6FT Metal Storage Shed, Outdoor Storage Shed, Garden Shed, Roofed, hed Tool Box with Foundation Ventilation & Doors Light Green",
    "price": "€650",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nFeatures:\nThe space is spacious enough for storing all your outdoor tools, equipment and gardening gear\nMade from galvanised steels with a weathered top coat for durability and protection against the outdoor elements\nSliding double doors for easy access\nSlopped roof for the water to roll to floor, preventing build up and rust formation\nFour ventilation holes provides aeration inside, preventing mould and mildew build up\nFloor foundation included, with all parts pre-cut and pre-drilled\nplease use gloves when installing\nAssembly required\nSpecification:\nItem Name: Garden Shed Storage\nBrand Name: Outsunny\nColour: Light Green\nMaterials: Galvanized Colour Steel, PP\nOverall Dimensions: 277L x 191W x 192Hcm\nDoor Size: 96L x 152Hcm\nWall Height: 155cm\nCapacity: 9.3m³\nFlat Pack: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzA3OWNlNDY4MmYwZmQ0OWU3ODUzNTZhMjRhZTcxNTNlZjFmOWFmZTE3NzQ5NWIyNTUzMzA1NzI3MjdlYjY4Ny5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=f48b90b55d1a665e1dae46167ab87a46ac0e196859277aea9362b7db88709d12"
    ],
    "url": "https://www.adverts.ie/other-building-materials/9-x-6ft-metal-storage-shed-outdoor-storage-shed-garden-shed-roofed-hed-tool-box-with-foundation-ventilation-doors-light-green/37317957"
  },
  {
    "title": "Bird Cage Grey 215x78x200 cm Galvanised Steel",
    "price": "€525",
    "description": "Condition: New\n\n\nPlease read the description\nbrand new!  available for delivery only\n\n no collection!  fixed price\n\n product details:\n\n delivery nationwide ireland:\n\nDelivery Time period 4_6\ndays\n\nDelivery charges 25€.\n\nDescription\nThis bird cage provides a cosy and comfortable place for your birds to fly and play safely.\n\nSturdy frame: Thanks to the sturdy galvanised steel construction, this bird house is durable and built to last.\nWelded fence: The aviary is equipped with welded fence that prevents mischief and unexpected accidents. In addition, they also allow you to observe your birds daily and guarantee your birds a wide field of view and enough fresh air.\nAmple activity room: The bird aviary provides your birds with ample activity room to walk around, play and fly around with ease. Besides, it is also suitable for other small animals such as rabbits, ducks, chickens, geese, etc.\nExtra security: The hinged door with a lockable latch system of the budgie cage ensures extra security and safety for your birds.\nSpecifications\nColour: Grey\nMaterial: Galvanised steel\nDimensions: 215 x 78 x 200 cm (W x D x H)\nHouse dimensions: 207 x 68 x 200 cm (W x D x H)\nGate size: 57 x 160 cm (L x W)\nAssembly required: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZWQ1OTg2MDdhMmQxMGIzMGI4ZDUyYjZlMzhiZTgxMDY0OTk0ZTUxZjhmZmNjMTE0MjJlZDkxYzFlYTZkMGI3NC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=020931ec6beb5f502548027f39cf9539a7ac9237633c0863438e02a0754adc03"
    ],
    "url": "https://www.adverts.ie/cages/bird-cage-grey-215x78x200-cm-galvanised-steel/35202674"
  },
  {
    "title": "750g Commercial Spice Grinder Electric Grain Mill Grinder High Speed",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nSuper Smash Function: Motor Speed: 28000(r/min); Operation Time: 5 mins; Interval Time: 5–10 mins; Crushed Level: superfine mill; Principle: high-speed grinder. Fitness: 30-300mesh. Three-layer blade with a crushing blade, horn blade, and powder removal blade, It only takes 30 seconds to grind all kinds of dehydrated food into fine powder.\n\nDurable Material: The electric small spice grinder is made of food-grade stainless steel, featuring durability and no processing pollution. The buckle structure features good sealing and high-security ability. If you are unsatisfied with the grinding effect, you can sieve out coarse particles and grind them again for finer results.\n\nUpgraded Double Safety Designs: The wheat berry grinder automatically stops when the lid is opened, enhancing safety and protecting the user from injury. When the grain grinder is overloaded, the overload protector will work automatically to control the operation. In addition, the powder grinder is easy to operate with a 0-5 min timer.\n\nMultipurpose Dry Grinder: The powder machine can deal with various dried materials, including ① grains (soy, corn, barley, wheat, oats, rye, peas, coffee beans), ② spices (fennel, pepper, cinnamon, rosemary) ③ others (When grinding other tough items, please first slice them into small pieces). (Not suitable for wet, fresh, oily, or sticky materials.) It is widely used in families, kitchens, hospitals, and medicine processing factories.\n\nUsing Tips: 1. This commercial coffee grinder machine can only be turned on after fully buckling the lid. 2. The materials ready for grinding must be dry enough. 3. Rest the machine for 5–10 minutes after every 5 minutes of operation. 4. Ensure the grind materials cover the long blade and no more than 2/3 of the jar. 5. Don't clean the grinding tank with water directly. Instead, use a dry rag or brush to clean the machine",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMjA2MGMwNjk4YTBmZTBkMGRkMWQyZjJiZDQxY2Y0ODkwZjJmYzcxNGE0MDJhY2NiMTg4Y2EyNTFjZDZlNzBkNS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=2e5b59ca05e241cc9db7b4269fc92a9b8dda588cae59670651fba1971e0619bc"
    ],
    "url": "https://www.adverts.ie/other-home-garden/750g-commercial-spice-grinder-electric-grain-mill-grinder-high-speed/37430336"
  },
  {
    "title": "Bar Table Set, 2 Breakfast Tables with 4 Stools, Counter Height Dining Tables & Chairs for Kitchen, Living Room, Grey",
    "price": "€450",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nClassic and simple look blends well in a variety of stylish home setups\n6-piece set consists of 2 rectangular tables and 4 barstools\nThe tables can be placed against a wall or can even be paired together\nStools can be located under the table to save space\nParticle board top ensures easy cleaning, while steel frame adds to its sturdiness and stability\nIdeal for bar area, dining rooms, kitchens, and where space is limited\nRequired assembly\nSpecification:\nColor: Grey\nMaterial: Particle board, Steel\nOverall Dimensions: 100L x 40W x 90Hcm (table), 29.5W x 29.5D x 61Hcm (stool)\nWeight Capacity: 60kg (table), 120kg (stool)",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzE3ZDZmODQ3MmIwZDQxMTU4MTJhN2E4NDYyMmI0ODNlOWFiYmI0M2UyNjkxMGVmNTlkNzA1Y2VmOTlhZGE0Mi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=f8af33f2f3f32e32284c7a2e2260a422986c3914417346d4438a634ebf10aa8f"
    ],
    "url": "https://www.adverts.ie/other-furniture/bar-table-set-2-breakfast-tables-with-4-stools-counter-height-dining-tables-chairs-for-kitchen-living-room-grey/37430329"
  },
  {
    "title": "Kids Step Stool, with Adjustable Platform and Non-Slip Mat Grey",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\n· Made of HDPE material which is non-toxic and does not contain an unpleasant odor\n· Uniquely designed with three adjustable built-in platform heights, which can adjust to different heights based on your preference\n· Suitable for many occasions such as kitchen, washroom and dining room and bedroom\n· Specially designed with effortless installation, less hardware, and less time\n· Anti-slip mat prevents kids from falling\n· Suitable for kids age between 18 months old to 5 years old\n· Assembly required\nSpecification:\n· Colour: Grey\n· Material: HDPE\n· Overall dimension: 47L x 47W x 90H cm\n· Platform dimension: 40L x 18W x 4T cm(Lower), 40L x 28.5W x 4T cm(Upper)\n· Upper baffle size: 40L x 2W x 22H cm\n· Lower baffle size: 40L x 2W x 24.5H cm\n· Suitable age: 18 months-5 years old",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZjBlMjY5YWIzN2ZjYWM4NmQ2ZDdhODcxOWJhMjE1ODlhYWMwMTFkZjgzNDEyNTlkNWQwZjc5M2VmNTcxMjA3OS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=c988e0d4f71ae34f3737d4a3558c3bb0c885bc4ed101bfdf9b8dae04ade2818a"
    ],
    "url": "https://www.adverts.ie/home-storage/kids-step-stool-with-adjustable-platform-and-non-slip-mat-grey/37430323"
  },
  {
    "title": "Electric Fence Netting, 35\" H x 164' L, PE Net Fencing with Posts & Double-Spiked Stakes, Utility Portable Mesh for Goats, Sheep",
    "price": "€275",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nComprehensive Size Design: The electric fence netting is meticulously designed in a large size of 35 in x 164 ft/0.88 x 49.98 m, combined with scientifically spaced grids, ensuring a solid enclosure for animals of all sizes. Each double-spiked stake and fiberglass post is precisely spaced, providing the strongest fence stability.\n\nSturdy and Durable: Our electric netting withstands the test of weather, with the combination of windproof kits and solid fiberglass posts ensuring long-term durability. The included warning sign and repair kit make maintenance easier, keeping it as good as new for a prolonged period.\n\nWide Applicability: Whether it's sheep, deer, hogs, or dogs, this electric netting fence is suitable for various large livestock, providing comprehensive protection for your farm.\n\nEffective Electric Current: The electric net fence precisely controls the intensity of the electric current, effectively protecting without harming animals. It ensures the security of your poultry and livestock while maintaining long-term protection of the fence.\n\nMultiple Power Supply Options: This electric fence supports external power supply of AC110-240V, as well as solar panels and DC power supply (not included). These multiple power supply options reduce energy consumption and provide a green solution for your farm.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNzUzMTcwMmU4YmE5OTQwN2U2NWUzYzI0YTE1ZDg4YTFmY2VjZDE1YTI5ZmIyMTA2NjZlMTM0MjNhYzBlNDc3Yi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=eaca4709d1cec88facaa4bf628a188ab8fa8dd701a086b48c6b388142690aaaf"
    ],
    "url": "https://www.adverts.ie/other-home-garden/electric-fence-netting-35-h-x-164-l-pe-net-fencing-with-posts-double-spiked-stakes-utility-portable-mesh-for-goats-sheep/37430313"
  },
  {
    "title": "6pcs Box Blade Shank, 16\\'\\' Scarifier Shank, 3 Holes Box Scraper Shank, Ripper Shank with Removable",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nHassle-Free Assembly: Shank Height: 16\". Shank Width: 8''. We provide a complete set of mounting fittings. The box blade can be easily attached to the tractor via the three-point holes without any complicated procedure.\n\nAdjustable Shank: Hole Spacing: 1-1/2\". Hole Diameter: 1/2''. Each shank has three-position adjustment holes that pin to the reinforced frame for maximum efficiency. You could adjust it according to your specific needs.\n\nHeavy-Duty Steel: Our box blade is made of premium quality steel for excellent durability and reliability. It is powder-coated, making it long-lasting and rust-proof.\n\nRemovable & Replaceable: Tooth Length: 4\". Tooth Height: 2\". The box blade is a very maneuverable tool that does the work of several implements. There are two replaceable teeth for your flexible use.\n\nExtensive Use: Box blades are designed for rugged use by landscapers, farmers, and homeowners. They are great for landscaping, land leveling, back-filling, grading, etc.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNmI3N2U5MmQyYWI0MzdkMDA2NTEyYmVhZDllZmRhNDc4NzU2MWNjODVhZGI3NmM5ZDVkMDM3YzU4YmVlOWUxOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=e2affdfe498e70b7f3ab74594965fb08e303ad7f870575d4e6165229b7bba9f8"
    ],
    "url": "https://www.adverts.ie/power-tools/6pcs-box-blade-shank-16-scarifier-shank-3-holes-box-scraper-shank-ripper-shank-with-removable/37430302"
  },
  {
    "title": "28in Log Lifting Tongs 2 Claw Solid Steel Log Grapple Swivel Log Lifter",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nFlexible Grip: The 28-inch log tongs feature an adjustable opening from 24 to 28 inches, providing a secure grip for various object sizes. This flexibility enhances efficiency and ensures stability during operation.\n\nHigh Load Capacity: With a maximum load capacity of 1100 lbs, these log lifting tongs make heavy-duty tasks like transporting logs, wire mesh, and hay bales easier and safer. Equipped with a 360° rotating hook, they allow for quick adjustments and smooth handling. The ergonomic design minimizes fatigue, improving overall comfort and usability.\n\nPowerful Two-Claw Grip: The logging tongs features sharp, claw-like two-prong design that censures a firm hold on objects, reducing the risk of slippage and enhancing both safety and efficiency during tasks.\n\nDurable Construction: Crafted from high-hardness forged steel with a rust-resistant powder coating, these log skidding tongs are built to withstand harsh environments, ensuring longevity and reducing maintenance or replacement needs.\n\nCompatible with Various Vehicles: Suitable for tractors, ATVs, UTVs, trucks, and forklifts, these heavy duty logging tongs simplify heavy lifting, making log transportation efficient and effortless. Say goodbye to manual labor and enjoy a smoother, more efficient workflow.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNzNlZjIwMmVmYWYzYTQ0YzdmZWU4YTI1MWIxNDM1OWU3NmVlMzExZTcxNDI5MTY3MzA2ZWY5MDk5ODM0YTgwYy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=3d74ffbd7ebc6bbc2a11032efd1fa5d194b8f01c2b33a70f5add20b72f0d94f9"
    ],
    "url": "https://www.adverts.ie/other-art-craft/28in-log-lifting-tongs-2-claw-solid-steel-log-grapple-swivel-log-lifter/37430293"
  },
  {
    "title": "Commercial Rice Cooker 60-Cup Non-Stick Pot 13L 24H Keep Warm Restaurant",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nDurable Construction: The VEVOR commercial rice cooker is made entirely from high-quality materials, resistant to rust and corrosion, durable, and resistant to wear even with long-term use. It's easy to clean and maintain, extending its service life.\n\nSuper Large Capacity: With a total capacity of 13 liters and the ability to cook 5.6 liters of rice at once (equivalent to 60 cups of rice), it's ideal for meeting the needs of 50-60 people. Whether for large family gatherings, parties, or commercial settings, this rice cooker can serve you well.\n\nHigh-Quality Non-Stick Inner Pot: The non-stick inner pot and streamlined design make cleaning effortless. The non-stick surface prevents rice from sticking together, ensuring delicious and fluffy grains every time.\n\nPerfect Cooking: Equipped with a powerful 2000W heating base, this rice cooker efficiently concentrates energy for even heating, effortlessly cooking delicious food. Additionally, its built-in keep-warm function ensures your rice stays warm for extended periods, ready to be enjoyed.\n\nOne-Touch Control: This commercial rice cooker features one-touch operation; once the rice is cooked, it automatically switches to keep-warm mode, making it simple and straightforward. Just press a button to start the cooking process and easily switch to keep-warm mode.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYzBkYzQxYmIwOWI4ZTE1ZTE5MGExNTQ4YmQ4MTU2M2QwYTliZDMzMmMxY2YwNzUwNDE2YTUwZTYwNzZkMDIzZC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=eb866f82f08e296a36cc0d3cd8fe4e21bcbd101fe999e61700d809f760051263"
    ],
    "url": "https://www.adverts.ie/hobs/commercial-rice-cooker-60-cup-non-stick-pot-13l-24h-keep-warm-restaurant/37430279"
  },
  {
    "title": "10 x 10 FT Pop Up Canopy Tent, Outdoor Patio Gazebo Tent with Removable Sidewalls and Wheeled Bag, UV Resistant Waterproof",
    "price": "€350",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nStands up to All Conditions: The gazebo top is made from 240g PVC-coated polyester, and the transparent sides are made of super high-quality PVC material. Both materials are resistant to high temperatures, strong wind, and water. The transparent canopy tent sidewalls also provide a 360-degree panoramic view of nature. You can see outside clearly while enjoying nature with this canopy tent while staying protected from the sun, wind, and rain.\n\nAdjustable 3-Height Options: There are 3 options for the side height of this outdoor patio gazebo tent, which is 6.4ft, 6.7ft, and 7ft, accordingly peak height 9.7ft, 10.0ft, and 10.3ft. You can choose a suitable height for all your needs. Whether you want to set up a shady spot for a gathering, host a party in spring, or protect your cars or boats of all sizes, this carport tent will suffice.\n\nAssembly In No Time:Requires only two people to complete the entire assembly in just a few minutes. Effortlessly take out the pop-up canopy frame and top tarpaulin from the bag, place it on the ground and unfold it. Next, place the tarpaulin over the frame and pull it to each corner end completely. Finally, extend the legs and enjoy. It's as easy as that!\n\nFollows You Anywhere:As a bonus, we provide a convenient roller bag with heavy-duty wheels made of 600D oxford fabric. It is big enough to store the canopy tent when you are not using it. When you go out, you can put it in a vehicle and take it to any place you want. Take it on the go whenever, wherever.\n\nBroadly Applicable: The shadow coverage of this canopy is 10 x 10 ft, and it can accommodate 6-7 people. Whether you want to hold an outdoor wedding or gathering, park your car, set up a stall, or enjoy a barbecue, it will always be by your side, no matter the conditions.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMTI0YTZmMTNiODFkY2NhMWI1MzFjOGFkNTQ5OTEwODMwYTkyZDJlMmRhNDU2Y2UxOTRmNmJiMzllMzBjNDg4OS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=ffa93c412085c0776e765d93018cafd389ce9330e4c8e34412b73067e9a9c85b"
    ],
    "url": "https://www.adverts.ie/home-storage/10-x-10-ft-pop-up-canopy-tent-outdoor-patio-gazebo-tent-with-removable-sidewalls-and-wheeled-bag-uv-resistant-waterproof/37430270"
  },
  {
    "title": "8500W Commercial Stainless Steel 450lbs Meat Grinder Cutter Blade Plate Sausage Stuffer",
    "price": "€500",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nPremium Quality: Made of food-grade stainless steel, wear-proof, and rust-proof, including the outer casing, top tray, and blades, our commercial meat grinder provides you reliable using experience with its gears being able to cut the meat into various kinds you desire. Its polished surface and fine workmanship make it beautiful in appearance. And it is easy cleaning and stands up for a longer working period.\n\nPowerful Performance: Featuring 1100W power motor, the meat grinders can reach a speed of 193r/min and grind approximately up to 150 kg/330lbs of meat per hour, able to grind meat fast and conveniently. It can be applied to versatile ingredients, including small chicken bones and fish bones. With special thread design, the efficiency is much higher than that of ordinary thread.\n\nEasy to Use: Simple to operate this electric meat grinder with just one button. The feeder tube is 54 mm/2.1inch in wide so that fine chopping of meat is not required before grinding. The air vents provide good heat dissipation, ensuring the long-term stable use of the motor. And the noise of this machine is very low when it’s running. Besides, the smooth surface simplifies the cleaning process as well.\n\nWell-designed Details: A meat pusher is included for convenient stuffing of meat. 2 grinding plates (6 mm, 8 mm) are also contained. The 6 mm grinding plate is mounted on the machine, and we also offer you a grinding plate in 8 mm for coarse or fine grinding. Voltage: 220V / 50Hz, Speed of blade: 550LB/H, Motor power: 1100W, 150 kg/ 330lbs of meat per hour, 225RPM cutting speed.\n\nWide Application: In addition to meat, the commercial grinder machine can also be used to grind fish, chili, vegetables, etc. And it’s suitable for various situations including home kitchens, hotel restaurants, and company use. This meat grinder is your perfect helper in meat cutting.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiY2RkMTUxOTUxNjNmYjVlMjczOTA4OWFjMzlmNTU0ZDY0NGMxYjI3Y2YzMDU2ZGIzNTgyNjA4OGI1YzFiNTQ2YS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=741bcba795ad8f4d1a6baf1dc9f37130768e3344d9f5010a077b486c06908120"
    ],
    "url": "https://www.adverts.ie/other-home-garden/8500w-commercial-stainless-steel-450lbs-meat-grinder-cutter-blade-plate-sausage-stuffer/37430264"
  },
  {
    "title": "Clamp on Pallet Forks, 2000 lbs Capacity Pallet Forks, 60\" Tractor Bucket Forks, Heavy Duty Front Loader Attachment for Loader",
    "price": "€385",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\n2000 LBS Capacity: Made from durable square steel tubing, these pallet forks can easily handle your everyday needs without bending or breaking under pressure\n\nReinforced Bolts & Screws: With reinforced bolts and grooved screw heads, our clamp on pallet fork is built to last.\n\nVersatile Usage: Our tractor fork is perfect for a variety of tasks such as moving logs, wood, and firewood, transporting fence posts and hay bales, clearing debris and bushes, and more.\n\nEasy Installation & Versatile: Our tractor fork is designed to handle a variety of tasks. Simply slide the fork over the cutting edge of your bucket and clamp it down to lock it in place. You can use it to move logs, wood, and firewood, transport fence posts and hay bales, clear debris and bushes, and more.\n\nProduct Dimensions: This pallet fork for tractor and bucket measures 60\" overall length, with a 43\" fork blade. The blade has a height of 2\" and a width of 2.75\". The gap between the lip of the bucket and the blade is 2.95\". The adjustable range of the stabilizer bar is 19.5\" to 36 \"W. Each package contains 1 x fork, 1 x stabilizer bar, and 1 x user manual.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYmRlMTY4MmMwYzI4ZDRjMmNlMTdlYjIyNDVkMDhhM2I4ZDQ5MTBmYTY1MjJmZmM0NTAyNWZhNTkyNjgzYzVjMy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=8e3b30420677610227f1464bd793f79c1b796df6ea6ff4a51af62a8c7afa3aca"
    ],
    "url": "https://www.adverts.ie/power-tools/clamp-on-pallet-forks-2000-lbs-capacity-pallet-forks-60-tractor-bucket-forks-heavy-duty-front-loader-attachment-for-loader/37430259"
  },
  {
    "title": "Pottery Wheel Mini Ceramic Wheel Sculpting Tools Apron Two Turntables 30W",
    "price": "€185",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nConsistent Performance: With 30W of raw power, it's built from the finest materials to handle the toughest jobs. The 1kg bearing capacity and the optional turntable of two sizes can allow the production of pottery works of different sizes. Create on a grand scale with unlimited potential. This motor is ready for anything you can dream up.\n\nComplete Sculpting Tools: This kit includes everything you need to sculpt masterpieces, from a 16-piece toolset to a waterproof apron. Whether you're a professional in the studio, a teacher in the classroom, or a DIY enthusiast at home, this machine is versatile enough to bring your vision to life. Get ready to mold, shape, and create ceramic works of art like never before!\n\nComfort for Any User: Its detachable water basin is a breeze to clean and provides added durability to keep your machine secure from water. Ideal for beginners, this machine streamlines your creative process for a more enjoyable pottery experience.\n\nArt without the Noise: Step up your pottery game with the upgraded brushless motor! Create in peace with its whisper-quiet operation, smoothly reaching speeds of 0-300 rpm/min. Say goodbye to frustrating vibrations and shakes, as the motor reduces friction and ensures a delicate touch to your work. Focus on your art without distractions, and elevate your creations to the next level.\n\nChoose How You Spin: Take your pottery game to new heights! Gently twist the speed control knob and get started to experience a simple and flexible operation, more friendly to the novice",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNjQwMjUyM2RmYjEyZjI5MThlYjEyZWY1Y2Q3OGRkMDkxNGE2MGFiZTY4YmMzYjYzMjc3YjZiOTQxY2JhMzMxZi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=8cbf361f8f5e134127d7fe07cc1b9d307270b1ec289ebbb94372fc6856eccfea"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/pottery-wheel-mini-ceramic-wheel-sculpting-tools-apron-two-turntables-30w/37430244"
  },
  {
    "title": "Mid-Century Dining Chairs Upholstered Linen Fabric Accent Chairs with Metal Legs, Set of 2, Light Grey",
    "price": "€385",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nFeatures:\nPackaged in a set of 2, perfect for having a cozy dinner or making a small talk for two\nA touch of Nordic look blends well in a variety of stylish home setups\nDecorative channel tufting enhances its support tightness\nSoft cushioned seats delivers exceptional comfort\nThe ergonomic curved backrest helps in keeping relaxed body posture\nBreathable linen fabric and steel legs ensure easy cleaning and durability\nAssembly required\nSpecification:\nColor: Light Grey\nMaterial: Linen, Steel\nOverall Dimensions: 59.5W x 56.5D x 81Hcm\nSeat Size: 42W x 42Dcm\nSeat Height: 48cm\nBack Size: 41W x 38.5Hcm\nWeight Capacity: 120kg",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNDY5OTQwYWM4MmQzYjFjNzgyYmVjNTAwMjc3YTRhZDU4ZWIzNTBmYmUwZDdlNjQ5MzI2ODUwYzNiOGE1MDBkOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=526ef3e40c37ff7acf5148025b025dcefec80e9b5077933b45eb0a294d1dec2c"
    ],
    "url": "https://www.adverts.ie/office-tables-chairs/mid-century-dining-chairs-upholstered-linen-fabric-accent-chairs-with-metal-legs-set-of-2-light-grey/37430233"
  },
  {
    "title": "Livestock Stand Goat Trimming Stand 21\"-33\" Height 51x23 in Tabletop White",
    "price": "€375",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nPremium Material & Safety Design: Our livestock stand is constructed from high-quality iron pipes and coated with spray paint, ensuring durability and resistance to rust. Carefully designed smooth edges reduce the risk of injury to both animals and operators during use.\n\n4-Level Adjustable Height: Featuring a unique pin design, our goat stand offers four height settings ranging from 21\" to 33\", accommodating animals of varying sizes. Reinforced uprights with a triangular frame provide added stability and support, enhancing safety.\n\nHeavy-Duty and Spacious: With a tabletop measuring 51x23 inch and a weight capacity of up to 500 lbs, our goat trimming stand is perfect for animals of various weights. An adjustable metal headpiece secures animal heads, facilitating trimming, health checks, and grooming tasks.\n\nQuick Installation: Illustrated instructions and clearly labeled accessories ensure easy and precise assembly. Included livestock nose loop and Velcro straps simplify animal restraint for efficient handling.\n\nVersatile Application: Ideal for a variety of animals such as goats, sheep, and calves. Our trimming stand is suitable for shearing, milking, hoof trimming, bathing, and more. It provides comprehensive solutions for professional and efficient animal care.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYzQ3YzRhZjE5Yzc0ZDliZjEyZWY5ODM2ZDcxZGU4YWQ2NmNmYWI0YmJiNzhjNDlkMTVmMDQxNjViNzcyMjU0NS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=d7807ab54bdb94a3e9ba1fac2de588b69846272789bf1f4df1e9aac43f7a498c"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/livestock-stand-goat-trimming-stand-21-33-height-51x23-in-tabletop-white/37430224"
  },
  {
    "title": "85cm Dining Room Table, Industrial Style Kitchen Table Round with Steel Legs, Rustic Brown",
    "price": "€350",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nClassic wood-effect top, with industrial-looking black frame\nLarge enough for four people\nPowder coated steel frame for a strong base\nNon-slip feet gently protects floor\nAssembly required\nSpecification:\nColour: Rustic Brown, Black\nMaterial: Particle Board, Steel\nOverall Dimension: Φ80 x 76H cm\nWeight Capacity: 60 kg\nRecommended Minimum Space: 1.2 x 1.2m",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMGIxMDEyNmE5M2U2YmM0MmUwMjZiNjRlMDE4OWY3YjkzMzFlOTdiZmU0YzMzYWMzZWQxYmQwYjJhM2JmOTNkOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=9f5d14f16e6a2444ec4bf1e6eb7c4d699bb5fcd704db9f0faccd84f8653fd13b"
    ],
    "url": "https://www.adverts.ie/armchairs/85cm-dining-room-table-industrial-style-kitchen-table-round-with-steel-legs-rustic-brown/37430216"
  },
  {
    "title": "EURO Coin Sorter with Large LCD Display Hold up to 1500 Coins 5 Coin Tubes",
    "price": "€285",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nEfficient Sorting: The newly upgraded sorting technology increases work efficiency by 10%, allowing the machine to sort coins at a speed of 147 coins per minute. This significantly reduces the hassle of manually counting coins and boosts work efficiency, making coin sorting easier.\n\nLarge Capacity Design: Our coin sorter features a large capacity design that can hold up to 850 coins. This reduces the need for frequent emptying, enhancing the overall efficiency and convenience of your workflow.\n\nSimple Operation: The coin counter is equipped with an easy-to-read LED interface and simple control buttons, making it user-friendly. You can monitor the coin sorting process at any time, making it easier to manage and track, ensuring greater efficiency in your coin handling tasks.\n\nEasy Packaging: Simply place the coin packaging paper into the tube, and the machine will automatically fill it. This feature makes it easy to quickly package large quantities of coins, saving you valuable time and effort on storage.\n\nMulti-Scenario Application: Whether you're at the cashier or in the office, our coin sorter meets your needs with high-speed sorting, large capacity storage, and easy operation. It brings convenience and efficiency to your work, no matter the environment.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzZkN2Q0ZTAwNzMyZGI2NzBkMWVlNDQyODYzZTdmMGRkMjVjMTFlNjRiNzgwYzhlNTQyY2NlZTg4OTBlYjcwMi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=6fb91b3b344fb4a63bf1c7ef13f26ea0f3b7d90ef5dfc491dd63cd86924c6e58"
    ],
    "url": "https://www.adverts.ie/power-tools/euro-coin-sorter-with-large-lcd-display-hold-up-to-1500-coins-5-coin-tubes/37430207"
  },
  {
    "title": "Commercial Vegetable Fruit Chopper 1/4\" Blade Heavy Duty Professional Food Dicer Kattex French",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nStainless Steel & Aluminum: The commercial vegetable chopper is made of heavy-duty stainless steel and aluminum alloy, durable and corrosion-proof. The service life of the chopper is extended. Food grade 420J2 stainless steel blades ensure health and hygiene.\n\n1/4\" Blade Available: The commercial chopper is equipped with a 1/4\"blade, which is sharp and sturdy. Each blade set also comes with two spare blades. You can use this cutter to cut vegetables and fruits according to your own needs.\n\nErgonomic Handle: The ergonomic pull-down handle adopts the principle of leverage to save your labor and time. You can easily press the handle to cut the vegetables and fruits over the sharp blades. You can easily prepare French fries and vegetable salads with a commercial chopper without effort.\n\nGood Stability & Easy Cleaning: The four non-slip feet of the potato dicer are wear-proof, solid, shock-absorbing, non-slip, and odorless, which ensures stability and performance during operation. The blades and push block are both removable and washable, easy to clean and maintain.\n\nMultipurpose Vegetables Fruits Chopper: The heavy-duty chopper is very suitable for restaurants and home kitchens. It can be used to cut potatoes, carrots, cucumbers, and other vegetables and fruits. It is ideal for those who want to prepare vegetables and fruits for salads, French fries, and desserts conveniently and quickly",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOGM4OTVhODhiNWMyZjJmNzdmZGRlZDcyYjY1YzllNmVlYjk0ZGM4Y2FkMjM1NjZkNDEyYTQyOGQyY2JlMGUxNy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=082a5d55e59824ff7980f69789ae7d1b89cfa12c2661a6988ca875cd1663efd1"
    ],
    "url": "https://www.adverts.ie/home-storage/commercial-vegetable-fruit-chopper-1-4-blade-heavy-duty-professional-food-dicer-kattex-french/37430196"
  },
  {
    "title": "12 Inch Pizza Dough Roller Sheeter Automatic Commercial Pizza Dough Press",
    "price": "€1,000",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nQuick Dough Press: Featuring a fully automatic design, simply place the dough into the upper roller's inlet for pressing, and then the oval-shaped dough is automatically/hand-flipped into the lower roller, forming a round pizza dough. It's a fast dough pressing process that eliminates unnecessary waiting time.\n\nPowerful Performance: Equipped with a robust 370W all-copper motor, this electric pizza dough roller can produce up to 260 dough sheets per hour. Its well-designed housing features extensive ventilation for efficient heat dissipation and prolonged lifespan.\n\nAdjustable Thickness: This pizza dough roller sheeter comes with two thickness control knobs, allowing you to create dough from 1 to 5.5 millimeters thick. Additionally, the wide rollers can press out pizza dough ranging from 3 to 12 inches, catering to various pizza sizes.\n\nHigh-Quality Materials: Crafted from food-grade stainless steel, this pizza press machine is rust-resistant, corrosion-resistant, and easy to clean. The food-grade resin rollers are durable and sturdy, suitable for thin dough. The protective cover, made of PC material, prevents dust and accidental injuries.\n\nWide Application: This commercial pizza dough sheeter is versatile and can be used for making thin sheets, pizza dough, pizza crusts, pizza skins, puff pastry, bread molds, pie crusts, flatbreads, and more. It's suitable for both home and commercial use",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMGY2YjUwNzUxNjEzNTM5MjQ4ZTFjMjQ1YmQxOTJmOWU5ZDg2MjIyNzI2YmVkNjc5NTNiNDNjYTI5ZWJmM2UyOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=43d27080f598a2028e81b08c5e582515f5dd356f910a5275a7f0880b7d8dca27"
    ],
    "url": "https://www.adverts.ie/other-home-garden/12-inch-pizza-dough-roller-sheeter-automatic-commercial-pizza-dough-press/37430193"
  },
  {
    "title": "Artificial Decorative Wreath 24 in Red Orange Yellow Hydrangeas Roses",
    "price": "€100",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\n1:1 Replica Flower Design: This decorative wreath features a 1:1 replica flower design, full and lush, with each hydrangea, rose and leaf exquisitely crafted to be lifelike. The colors are vibrant and the details are finely done, creating a realistic appearance.\n\nPremium Silk Fabric: This all-season wreath’s flowers have vibrant, long-lasting colors. The material is durable, easy to clean, and fade-resistant, making it suitable for long-term use. It is soft and realistic in appearance.\n\nVersatile Decoration: This front door wreath is ideal for various settings—whether for home decor, holiday celebrations, wedding arrangements, or commercial space beautification. It adds a natural, elegant atmosphere to any occasion.\n\nIdeal-Sized Wreath: When fully expanded, the faux wreath measures approximately 24 in in width. Whether hung on a front door, wall, outdoors, indoors, windows, fireplaces, or tabletops, it adds natural beauty without overwhelming the space.\n\nEasy to Hang: With just a few minutes of simple arranging, you can create an excellent indoor wreath. Hang it with a single nail to easily place it on a porch, fireplace, wall, or anywhere else as home decor!",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZDdjNWFmYjY5MmFlMzFmNjlkYTBjYjFlNjVmMzY3NDM2NzE0M2JjZDQ1MDFhNDVkNWQxMDQ4Y2ViN2Y3ZDRlZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=55a06c983bc62d899d2f64bf5d67074779e0c45f7564d6aaadc9322c3907b8b5"
    ],
    "url": "https://www.adverts.ie/home-storage/artificial-decorative-wreath-24-in-red-orange-yellow-hydrangeas-roses/37430179"
  },
  {
    "title": "60 Pcs Red Roses Artificial Flowers Realistic Bouquet for Xmas Home Decor",
    "price": "€100",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nLayered Bloom, Realistic Texture: You’ll receive 60 lifelike artificial roses, each meticulously handmade with a 5-layer petal structure for a natural, 3-dimensional blooming effect. These roses maintain their beautiful, full-bloom appearance for a long time, ideal for creating stunning floral displays\n\nLong-Lasting & Fade-Resistant: Each fake flower is crafted from high-quality flocking fabric, ensuring durability and resistance to fading or yellowing. Compared to traditional fresh flowers, these artificial blooms last longer, require no frequent replacement, and can be reused, saving you both time and cost\n\nFlexible DIY Floral Design: The rose artificial flowers measure 20\" in total height, with a 2.76\" flower head. The generous quantity is ideal for creating various floral arrangements for daily use or special occasions. The stems, made of durable PE-coated wire, can be easily bent or cut to your desired size, offering flexibility for all your creative ideas\n\nMaintenance Made Effortless: These velvet flowers require no watering or sunlight, making them ideal for those with little time for upkeep. If the flowers are slightly deformed during shipping, simply adjust them by hand or use a low-heat blow dryer to restore their shape. For daily care, gently wipe away dust with a clean cloth to keep them looking fresh and vibrant with minimal effort\n\nIdeal for Romantic Settings: Our fake roses are incredibly lifelike, ideal for creating warm and romantic atmospheres. Whether used alone or paired with other flowers, they will be your first choice for weddings, holidays, parties, or home decor. Let your creativity shine by designing bridal bouquets, cake decorations, or gifting a timeless bouquet to your loved ones",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZDYzNDE3YWJjNzA5YzUyZDg2ZmNkODYwZTk3NGNlMjFkODI1ZDJkM2Q0YzJiY2E3NjcyNDM4ZTc0ZWM5NjQ2NC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=20d3b3702ea09ecfdbd21f16ee0822badee715275f6790824d2f24469c336af2"
    ],
    "url": "https://www.adverts.ie/flowers/60-pcs-red-roses-artificial-flowers-realistic-bouquet-for-xmas-home-decor/37430168"
  },
  {
    "title": "Retractable Awning Blue and White 3x2.5 m Fabric and Aluminium",
    "price": "€500",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nEnjoy a cool drink, a tasty treat, or a good conversation on your patio with friends while lounging underneath this amazing retractable awning!\n\nDurable material: The awning frame is made of powder-coated aluminium, which is robust and durable. The fabric with PU surface treatment is UV resistant. It will prevent your family or guests from UV rays and dazzling sunlight.\n\nRetractable awning: The door canopy is retractable to meet your different requirements. It provides cooling shade when stretching and does not block the view when contracted too.\n\nWall-mounted design: The patio awning can be easily mounted on the wall with the included wall brackets and will not take up any floor space.\n\nWide applications: The retractable canopy features a simple and stylish design that will blend well with your home or commercial settings. It is suitable for a variety of places, such as balconies, patios, yards, restaurants, cafes, shops, and more.\n\nSpecifications\n\nColour: Blue and white\n\nFrame material: Powder-coated aluminium\n\nAwning material: Fabric (100% polyester) with PU coating\n\nSize: 3 x 2.5 m (L x W)\n\nAssembly required: Yes\n\nDelivery contains:\n\n1 x Awning\n\n1 x Frame",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMmRkNDYwMzhlYzZkNDllMTlhZDJjN2Q3ZDk4ODQ2YjRlOTBiY2M0ODZmMzhhNTRmMGVmODRiNmRmMmQ5YTM5My5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=e4db0ee096c7476861563528808baabadcf4431d6960e229890038e898f59c1b"
    ],
    "url": "https://www.adverts.ie/other-home-garden/retractable-awning-blue-and-white-3x2-5-m-fabric-and-aluminium/37430160"
  },
  {
    "title": "Retractable Side Awning Anthracite 160x300 cm",
    "price": "€275",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nCreate an instant and private oasis on your balcony, terrace, or patio using this retractable side awning!\n\nWater and UV resistant: This garden privacy screen is made from 100% polyester with a polyurethane (PU) coating, providing good breathability and excellent protection against wind, sun, water, and UV light.\n\nConvenient design: Thanks to its retractable design, the garden screen automatically rolls back when you remove the handle from the post.\n\nEasy installation: The two posts can be easily fixed to the wall and ground for added stability and safety using the included mounting accessories.\n\nWide applications: This versatile side awning can be used in a variety of settings, both outdoors like backyard, terrace, garden, porch, balcony and indoors such as office, clinic, studio, dressing room, to create extra wall space as required.\n\nSpecifications\n\nColour: Anthracite\n\nFabric material: 100% polyester with a PU coating\n\nFrame material: Steel and aluminium\n\nSize: 160 x 300 cm (H x W)\n\nAssembly required: Yes\n\nMounting accessories included",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiN2Q0MjZjNzc3NWQyMDdkMjM3ZDhmYmYwOTg5NTE4OWEwOGI1MWJlMGJkNDE2YWIyYWMwYTZlYzQzMTY3NjBhYS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=fec09aa5ac1aaa0e9289f5bc54252eb01164d72754e69b0931b9468010f9e88f"
    ],
    "url": "https://www.adverts.ie/sheds/retractable-side-awning-anthracite-160x300-cm/37430115"
  },
  {
    "title": "Wall-mounted Garden Parasol with LEDs 300 cm Black",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nThis elegant wall-mounted garden parasol safeguards your skin health by blocking most of the UV light.\n\nMade of UV protective and anti-fade polyester, the parasol cover provides you with optimum protection against the sun and is easy to clean. The exclusive design of this umbrella allows you to tilt it to block the sun as it heads down towards the horizon. The strong metal pole, along with the 8 durable ribs, makes the wall-mounted parasol very stable and durable. The garden umbrella can be easily opened and closed thanks to the crank mechanism. The integrated 28 LED lights create a cosy and romantic ambience at night.\n\nPlease note that we recommend treating the umbrella fabric with a waterproofing spray if it is subjected to heavy rainfall. The height of this wall-mounted parasol depends on the height it is mounted on the wall.\n\nSpecifications\n\nColour: Black\n\nMaterial: Fabric (100% polyester), metal\n\nOverall dimensions: 300 x 131 cm (Diameter x H)\n\nPole diameter: 48 mm\n\nWith the crank system\n\nIncluding 8 ribs\n\nWith 28 LED lights\n\nPower: 0.7 W\n\nDelivery includes wall attachment\n\nAssembly required: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZTcxNmY0ZGMxNGIxNjhlYmU5YzcwNTQ4NmU1OWU5NzM0Y2EzOWM2NGExNjRmZjJiOTgyZmJlY2FkYjVmNTk1MS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=3a71d40ff688f20ab5694902d455392bd3440fedbb136bbf10436bcd0475835b"
    ],
    "url": "https://www.adverts.ie/other-furniture/wall-mounted-garden-parasol-with-leds-300-cm-black/37430063"
  },
  {
    "title": "Free Standing Awning 400x300 cm Anthracite",
    "price": "€750",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nDescription\n\nThis water-repellent free standing awning is an ideal choice for gatherings in your garden or on the patio.\n\nWith a durable powder-coated steel frame and weather-resistant polyester canopy, this awning can be erected on any flat surface. Meanwhile, it is very sturdy and strong. The awning can be opened and closed smoothly.\n\nThis double-sided awning will keep your family and friends cool in the shade and shielded from the sun's UV rays.\n\nSpecifications\n\nColour: Anthracite\n\nMaterial: Powder-coated steel, 100% polyester with PU coating\n\nDimensions: 400 x 300 x 300 cm (L x W x H)\n\nSteel base: 90 x 60 cm (L x W)\n\nUV and weather resistant\n\nWater; dirt and dust repellent\n\nAssembly required: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYjgzOWU4YTY3NGZmMDAyODZmNjU5NWQ1ZDJkZmNiZGZlMDFjY2Y5OWNhZDU3MDM3OGE2YTYzZGVjZWU0OTM2OS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=91c7792d72b626c192aa4074a0985aa6f7cad36989d4a4dc94fefbf094effe3f"
    ],
    "url": "https://www.adverts.ie/heavy-machinery/free-standing-awning-400x300-cm-anthracite/37430036"
  },
  {
    "title": "4ft x 9ft Steel Garden Tool Shed",
    "price": "€475",
    "description": "Condition: New\n\n\nPlease read the description\nbrand new!  available for delivery only\n\n no collection!  fixed price\n\n product details:\n\n delivery nationwide ireland:\n\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nFeatures:\nSpacious design to store all your outdoor tools, equipment and gardening gear\nMade from galvanised steel with a protective top coat for durability and stable\nSliding and lockable double door for easy access\n2 ventilation windows ensure aeration inside, preventing mould and mildew build up\nFloor foundation included for an even structure on the ground\nAssembly required, please use gloves when installing\nSpecification:\nItem Name: Garden Shed Storage\nBrand Name: Outsunny\nColour: Deep Green\nMaterials: Galvanized Colour Steel, PP\nOverall Dimensions: 277L x 130W x 173Hcm\nDoor Size: 96L x 151Hcm\nWall Height:155cm\nFlat Pack: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZjQ4NGQyYzhhODZjNmVmN2ZkMzViYWY4MmFiNjEwNzMyZGY2MmI5YjVjZWEzNDcxNDgxNzJiYzg3M2U1NzkzOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=a01617d149ecceef9ac2aba7e00cc45431b08cf7730067b4848e2c17d9a8abce"
    ],
    "url": "https://www.adverts.ie/farming-equipment/4ft-x-9ft-steel-garden-tool-shed/34177486"
  },
  {
    "title": "Double Sliding Door Glass",
    "price": "€899",
    "description": "Condition: New\n\n\nPlease read the description\nbrand new!  available for delivery only\n\n no collection!  fixed price\n\n product details:\n\n delivery nationwide ireland:\n\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nDescription\nOur sliding glass doors are a fantastic way to give your home a contemporary twist and can transform the look of your space, making it appear bigger and brighter. The sliding glass doors are space-saving and modern, which will make a great alternative to traditional swinging doors.\n\nThe translucent glass is ideal for maintaining privacy, while allowing natural light to enter the room. The doors open and close effortlessly and the glass panels will glide quietly along the aluminium track.\n\nMade of high-quality materials, the glass doors are sturdy and durable. Complete with all fixings, the glass doors are easy and quick to install.\n\nSpecifications\nDimensions (each door): 205 x 75 cm (L x W)\nDoor material: Glass\nFrame material: Aluminium and stainless steel\nDelivery includes:\n2 x Aluminium track\n2 x Cover strip\n6 x Glass sheet (677 x 750 x 6 mm)\n2 x Floor guide\n4 x Door stopper\n2 x Door knob\n4 x Mounting kit\n4 x Connector for the rail",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYjkxMTEyZDg2YTkwMWRmNzFmMWQ4Mzk1MDg5MzkyYmI0Y2IxM2I4ZmI5OTBiMzkzMWIwOTIxZWU4N2VlNWViNS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=7b55374a0bfec0176ad9fbfcec37ae67f486891657ec570b26dec4510f9310ca"
    ],
    "url": "https://www.adverts.ie/other-health-beauty/double-sliding-door-glass/34065257"
  },
  {
    "title": "Modern Sideboard, Storage Cabinet with Glass Doors Cupboard, 2 Drawers and Open Shelf for Living Room, Hallway, Grey",
    "price": "€385",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nLarge storage space with a storage cabinet, two drawers, a wide tabletop and an open compartment\nFits dining room, kitchen, living room or other limited spaces needing a bit more storage\nTempered glass doors make an elegant look and keep out the dust\nMade of MDF body and rubber wood base for sturdiness and reliability\nSteel handles with gold finish for beauty and easy opening\nAnti-tipping design helps prevent it from tipping over\nAssembly required\nSpecification:\nColour: Grey\nMaterial: MDF, Rubber Wood, Tempered Glass\nOverall Dimension: 95.5W x 40D x 78H cm\nCabinet Inner Size: 59.5W x 37.3D x 27.8/29.3H cm\nDrawer Inner Size: 26W x 28.5D x 8.7H cm\nOpen Shelf Size: 30.5W x 37D x 28H cm\nBottom to Floor: 16 cm\nWeight Capacity: 30 kg (total), 10 kg (top), 5 kg (compartment), 3 kg (shelf), 2.5 kg (drawer",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMmJmZGFlNDI1ZTllZDNkNjM1NzcxZDFiMGUxMzE0YWI4ZmI3OGUzMjA1MjMzZDZjNDI1ZWFlMDY0NTVjYjAxNi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=c55ff4244fc031c41a0506340d3ce3203cf8e32efc9c3e1e1f335deef0652a05"
    ],
    "url": "https://www.adverts.ie/other-furniture/modern-sideboard-storage-cabinet-with-glass-doors-cupboard-2-drawers-and-open-shelf-for-living-room-hallway-grey/37235471"
  },
  {
    "title": "Modern High Rise Bathroom Basin Mixer Tap, Waterfall Bathroom Sink Taps, Single Lever Tall Tap for Counter-top Basin, Brass Faucet with Flexible Tails, Matte Black",
    "price": "€185",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nRecommended uses for product\n\nBathroom\n\nFinish type\n\nPolished\n\nMaterial\n\nBrass\n\nColour\n\nMatte Black\n\nNumber of handles\n\n1\n\nPleasing Waterfall Flow: The uniquely designed 3-layer metal filter ensures a delicate and smooth water flow while being quiet and water-saving. The high rise bathroom basin mixer tap is aesthetically pleasing and the wide spout allows the water to flow slowly down like a waterfall, pleasing your eyes. Frosted and angled spout design is not easy to accumulate water and prolongs service life\n\nReliable Solid Brass: Maynosi waterfall bathroom sink tap is made of high quality brass for optimal health and safety of your family. The tall mixer tap has been tested with level 10 salt spray acid to ensure corrosion, flaking and rust resistance. Wipe with a damp cloth to maintain a refreshed look and upgrade the beauty of your bathroom\n\nTrouble-Free Installation: The counter-top basin mixer tap is designed for first time installers and comes with easy to follow instructions and all the necessary tools. You can have it installed in less than 10 minutes, no need to hire a plumber. Fits countertop holes from 1.06 inches to 1.5 inches in diameter, countertop thickness can be around 2.3 inches, and is compatible with most UK Standard designs\n\nCaring about Leakage & Safety: The built in drip-free ceramic cartridge passes 500,000 leak tests to ensure the bathroom sink faucet is durable and leak-proof. The pre-installed hose avoids leaks caused by hand-tightening, making it easy for you to install. The inner layer of the hose is made of environmentally friendly PEX material and the outer layer is made of stainless steel wire to ensure health and long service life",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOTcwYmJjMTg1MTIzMzYxYjRmODQ5MWE2ODZiNjM3NWJmMmU4YWE0ODNhODRiYTM4YzY2YTBkZGY0MmE1MmFjNi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6MjkyfX19?signature=5f6a305fc8788c1cf7c8f87c1372f01a6789fb2dbd3cefd375f7dd9d25b0b021"
    ],
    "url": "https://www.adverts.ie/other-home-garden/modern-high-rise-bathroom-basin-mixer-tap-waterfall-bathroom-sink-taps-single-lever-tall-tap-for-counter-top-basin-brass-faucet-with-flexible-tails-matte-black/37422260"
  },
  {
    "title": "Coffee Table with 2-Tier Storage,100 cm Living Room Table with Round Corner, Center Table with X-Frame Design for Home Office,White",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nProduct dimensions52D x 100W x 47.5H centimetres\nItem weight13.6 Kilograms\nMaximum weight recommendation200 Pounds\nFrame materialMetal\nColourWhite\nStorage Space: The design of 2-Tier shelves increases storage space, and daily necessities are stored in the bottom shelf, making the desktop and living room more concise\nRounded Corner Design: Adopting a rounded corner design, it can prevent your children or pets from hitting sharp edges and getting injured while chasing and playing, making activities safer\nSturdy Structure: Using X-shaped support legs, the mechanical design ensures the stability of the coffee table, which can withstand a weight of 90KG, making the table more durable and reassuring to use",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNjI2YzViNTI2OGNlZDIwMWM5MmFlMDljYmI5MGNjYWE1ZjQzMjVkMjkzYzM1NjY3ZDAzMWYxMmY4MzMyZjlmZi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=a97bbeb7acea339808f8179d731c2c925820d4430a3c1ff2c2c17e76d1a4270e"
    ],
    "url": "https://www.adverts.ie/armchairs/coffee-table-with-2-tier-storage-100-cm-living-room-table-with-round-corner-center-table-with-x-frame-design-for-home-office-white/37422249"
  },
  {
    "title": "Shiatsu Back Massager with Heat -Deep Tissue Kneading Massage Chair, Massage Chair for Full Back, Chair Massager for Home or Office Chair use (Dark Grey), Gifts for Women,Men",
    "price": "€350",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nUse for\n\nBack, Neck\n\nPower source\n\nBattery Powered\n\nMaterial\n\nLeather\n\nItem weight\n\n10.4 Kilograms\n\nBrand\n\nCOMFIER\n\nColour\n\nGrey\n\nFull Body Massage: The portable massage chair combines Shiatsu, Kneading, Rolling compression, Kneading, Rolling, Vibration and Heat functions to provide you a spa-like massage experience\n\nShiatsu Neck & Full Back Massager: Comfier Back Massager with Heat has 4 Shiatsu nodes for neck and shoulder massage,the shiatsu balls position can be adjusted to meet specific user. The chair massage cushion has 4 shiatsu massage nodes that cover the whole back to deliver soothe massage for back\n\nOptional Heat, Rolling & Spot Massage: The electric chair massager provides optional heat settings to provide soothing warmth for back. The rolling massage setting gently slides along the spine throughout the back. Spot massage allows you have a more targeted massage by focusing the 4 rolling nodes to specific body areas\n\nAdjustable Compression: Compress massage with 3 adjustable intensity on waist and hips, helps customize your own setting in full-coverage. Opt for a full back, upper back or lower back then combine with compress massage and heat to create a fantastic relaxing massage",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZjliZjM5NTBlZmQ4OGJmZjNmNGJiMDljYjM0YTkzNDEzMThiYzE1ZjI0MzE5ZjJmZDc4MDhkNzYwNTcxMjMxOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyMjgsImhlaWdodCI6MjkyfX19?signature=fce070c7b2293493d58bd7cbfd5334ec83e7ed982b0ebea08974ed1fa3f5df59"
    ],
    "url": "https://www.adverts.ie/other-home-garden/shiatsu-back-massager-with-heat-deep-tissue-kneading-massage-chair-massage-chair-for-full-back-chair-massager-for-home-or-office-chair-use-dark-grey-gifts-for-women-men/37422242"
  },
  {
    "title": "Sideboard Black 105x35x70 cm Glass and Steel",
    "price": "€450",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nDescription\nThis classic sideboard, featuring a modern look, is a practical and decorative addition to your interior.\n\nStable material: The cabinet's frame is made of powder-coated steel. Steel is an exceptionally hard and strong material. It offers sturdiness and stability. The powder coating on steel creates a protective layer against wear and tear.\nFluted glass: Fluted glass features a vertical texture pattern and is able to create a hazy feel using embossing, allowing transparency and privacy to co-exist.\nAmple storage space: The sideboard cabinet offers ample storage space for keeping your various daily essentials well organised and within easy reach.\nAdjustable shelf: The cupboard is equipped with 1 adjustable shelf that can meet items of different heights and sizes and avoid wasting space.\nLevellers on the bottom: There are levellers on the bottom to stabilize the cabinet when standing on uneven floors.\nDisplaying function: The top of the storage cabinet is great for displaying your decorative items, photo albums or small plants.\nWarning:\n\nTo prevent it being overturned, this product must be used with the provided wall attachment device.\nPros and cons\nplus_fill\nThis sidebord is easy to clean due to its metal surface\n\nplus_fill\nSteel is a durable material\n\nplus_fill\nThe powder coating prevents rust\n\nminus_fill\nThis item should be mounted to the wall for safety\n\nSpecifications\nColour: Black\nMaterial: Powder-coated steel, fluted glass\nDimensions: 105 x 35 x 70 cm (W x D x H)\nWith 1 adjustable shelf\nWith levellers on the bottom\nAssembly required: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYzYyNGU1ZmZiOGE4ZGQwZDVlNTkxMGQ1ZTcxMjJjMWM4MGQxYjJmZGU4MGI0MGQxYmIyOGZkNTNkM2MwYzYwYS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=05cd4fa813c68555a6ce448f2922a6acff894f8b78d9b51afc9cddb63162d114"
    ],
    "url": "https://www.adverts.ie/office-cabinets/sideboard-black-105x35x70-cm-glass-and-steel/37422232"
  },
  {
    "title": "Retractable Side Awning Red 200x600 cm",
    "price": "€350",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nDescription\nCreate an instant and private oasis on your balcony, terrace, or patio using this retractable side awning!\n\nWater and UV resistant: This garden privacy screen is made from 100% polyester with a polyurethane (PU) coating, providing good breathability and excellent protection against wind, sun, water, and UV light.\nConvenient design: Thanks to its retractable design, the garden screen automatically rolls back when you remove the handle from the post.\nEasy installation: The posts can be easily fixed to the ground for added stability and safety using the included mounting accessories.\nWide applications: This versatile side awning can be used in a variety of settings, both outdoors like backyard, terrace, garden, porch, balcony and indoors such as office, clinic, studio, dressing room, to create extra wall space as required.\nSpecifications\nColour: Red\nFabric material: 100% polyester with a PU coating\nFrame material: Steel\nSize: 200 x 600 cm (H x W)\nAssembly required: Yes\nMounting accessories included",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNTY1ZDg3OGZjYTYyYWE1MmRiYWU2ZDg5M2Y3Y2E5ZDc5YjU5ZDI3ODQ4MWQwZGRkNTAxYmM5NWFmYzViN2YyMy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=2cce8f874ba603c80f9053dcc680b0b565404319c5f5b05f8f53b7b62a6ae499"
    ],
    "url": "https://www.adverts.ie/home-storage/retractable-side-awning-red-200x600-cm/37422226"
  },
  {
    "title": "800W Powerful Bagless Cylinder Vacuum Cleaner With German Wessel Werk Nozzle Head For Hard Floor & Carpet (C6T)",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nSpecial feature\n\nAutomatic Cord Rewind, Lightweight, Washable Filter, Bagless, HEPA\n\nFilter type\n\nFoam\n\nSurface recommendation\n\nCarpet\n\nPower source\n\nCorded Electric\n\nVoltage\n\n230 Volts\n\nPowerful: With Strong 800w Motor generate 19kpa vacuum power\n\nPerfloormance: Equipped with German Wessel Werk Patented 2 in 1 Head, improve 30% suction efficiency\n\nHygienic: with HEPA filter and easy-to-empty one touch release dust bin\n\nVersatile: Full set of tools , long hose, telescope tube, 5m cord length , ideal for home and office use, good for both Timber/Tiles Floor and Carpet/Rug, Turbo Head Floor Carpet Pet Hair",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNjEzYzU2MWM3MTBkMDhjMjU3MjI4Yjk1ZGU1N2QxYjBlOTEzYThkOTFhODI5M2FlZTJkODFiMDk3NGYxMDE1NS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyNjIsImhlaWdodCI6MjkyfX19?signature=a4b1785f978845f5abf000c7fce0884a7dfc7eb1bb679c983c699ddf1310248d"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/800w-powerful-bagless-cylinder-vacuum-cleaner-with-german-wessel-werk-nozzle-head-for-hard-floor-carpet-c6t/37422221"
  },
  {
    "title": "Steel Tongue Drum 14 in 15 Notes Rain Drum for Outside C Major Green",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nHandcrafted Steel Tongue Drum: This steel tongue drum with 15 Tones and C-key design allow you to play the complex songs and soothing harmonies. Upgraded tuning technology makes the 14-inch steel tongue drum suitable for both professional performance and beginners to use.\n\nMind Healing: The rain drum for outside garden make ethereal and beautiful tones that cleanse your mind and spirit and brings a sense of relaxation and joy, allowing you to slowly calm down from tension.\n\nBeginner-Friendly Instrument: This steel tongue drum comes with complete accessories that make it easy for anyone to play. The ethereal tank drum's metal tongue vibrates to produce a pleasant sound, making it suitable for children and beginners without any music experience.\n\nExcellent Quality Advantages: Made of high-quality carbon steel, this hand pan drum is reliable and wear-resistant for long time use. Handcrafted by master craftsman, and coated with fade-resistant paint, it showcases exceptional quality and craftsmanship.\n\nAs a Gift: This tongue drum can ignite others' passion for music, making an ideal gift for friends and family for holiday. Our rain drum is suitable for various occasions, allowing everyone to experience the healing effects of music together.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNDM3YmIzNTIyZGU0MGMxODZjNThhOGViZGRmOGMzMDVkZjIwZWFiNTViOWUwOTRjNGU4ZTdhNDQwNDU3ODJjZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=4a95d6fc045b2ad000f35edad77ef9023d1576a9a398c89afbac673fd1419f41"
    ],
    "url": "https://www.adverts.ie/other-business-office/steel-tongue-drum-14-in-15-notes-rain-drum-for-outside-c-major-green/37422199"
  },
  {
    "title": "BBQ Access Door, 508x356 mm Single Outdoor Kitchen Door, Stainless Steel Flush Mount Door,",
    "price": "€185",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nPrecision Opening: Overall dimensions: 508x356x46 mm / 20x14x2 inches, installation size: 17x11inch/423x270mm, it is recommended to reserve an additional 0.08inch/2mm on this basis for better operation. The door is designed specifically for outdoor kitchens and barbecue islands, adding an elegant touch to your cooking area. With precise dimensions, it is easy to process, install, or dismantle. Available in various sizes and styles, it is perfect for indoor/outdoor kitchens and all other outdoor weather conditions.\n\nHigh-quality Materials: This access door is made of sturdy high-quality stainless steel, rust-proof and waterproof. You can clean it well without leaving any traces. The integrated thickened frame structure is durable, with a fully seamless design, no sharp corners. The unique U-shaped panel structure provides better strength and durability. Magnets at the top and bottom keep the cabinet tightly closed, effectively preventing insects from accessing your food or anything inside the cabinet.\n\nLeft & Right Door Reversible Design: Adopting an L-shaped insert quick disassembly structure, the hinge can be removed for door direction adjustment. Doors open without blocking walls or hitting doors, eliminating the annoyance of left or right door openings, allowing you to adjust the direction according to your usage habits, making replacement convenient.\n\nHumanized Design: Delicate zinc alloy handles conforming to ergonomics, enlarged size for easy opening. The door frame edges are bent and thickened for safer use, providing a more user-friendly experience, allowing you to enjoy cooking in your outdoor kitchen without worries. It also equipped with louvred vents, allowing better air circulation in the storage compartment.\n\nEasy to Install: The external packaging prints a 1:1 installation perforated CAD drawing. You can follow the instructions to place the template where the bbq door needs to be installed and perforate according to the line drawing. It can be easily installed on any wall in minutes using embedded installation.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNjk2ZjEzZmE1MWQ5NjY5ZWIwNjdmNjMxZTEzZDEwNThiMzNlYmY2M2M4ZDdjMjI2OTdmODE2NTkwNjBmY2Q5ZC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=c38ff6fa5628bda1becd61e2cef0de9678bb76e09764788689e1ba8d60ab41ff"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/bbq-access-door-508x356-mm-single-outdoor-kitchen-door-stainless-steel-flush-mount-door/37422185"
  },
  {
    "title": "Steel Catering Work Table 12x24 Inch Commercial Work Table with 4 Wheels",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nHigh-Quality Stainless Steel: This work table, measuring 12 x 24 x 34 inch, is made from SUS201 stainless steel for the tabletop, shelves, and legs. It offers superior rust resistance, a sleek appearance, and a smooth surface that is easy to clean with a simple wipe. NSF certified, it meets strict public health standards, ensuring long-lasting protection for your health.\n\nStable and Durable: With an upgraded thickness of 0.8mm, this table is sturdy and durable. The upper shelf supports up to 400 lbs, while the lower shelf supports up to 300 lbs, providing ample storage for your supplies and allowing you to stack your favorite ingredients easily. Equipped with 4 swivel casters, including 2 with brakes, the table remains stable and can be easily moved to any location.\n\nAdjustable Height Design: The 3-level adjustable shelves offer the most user-friendly and practical features. Simply adjust the shelf height with screws to accommodate items of different sizes.\n\nVersatile Applications: Beyond storage, our table can be used for chopping vegetables, kneading dough, cutting meat, and other kitchen-related tasks. It is perfect for use in bars, restaurants, hotels, buffets, catering events, school activities, or office break rooms.\n\nPractical Sizes: Available in various sizes to perfectly fit your kitchen needs. Whether for commercial kitchens, home renovations, or your garage setup, our professional-grade stainless steel work table series is designed for lasting performance and reliability. We recommend measuring your space",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiODVlMGQ3ZDQwZGYwZDBkYWM2M2E3NDAxMGNjMjRmNTllMTlmZjQxMDQ4Yzg2YTY4NmM2ZWQzMjUzYmFiMmJiMy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=3d49b19ab65e8cc7638def61375d36d2ecbd6983d1610a80dc7fbc6df2d2f522"
    ],
    "url": "https://www.adverts.ie/home-storage/steel-catering-work-table-12x24-inch-commercial-work-table-with-4-wheels/37422165"
  },
  {
    "title": "8 ft L x 17 in W Curved Wooden Garden Pathway Roll Out Garden Walkway",
    "price": "€150",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nAesthetic Appeal: This wooden garden pathway measures 96 inches long and 17 inches wide, enhancing the visual attractiveness of any outdoor space while keeping your shoes clean and dust-free.\n\nSturdy Construction: Designed with rust-resistant wire rope and high-density rubber, this garden walkway ensures each section is securely connected and has a strong load-bearing capacity for strollers, wheelchairs, and lawn mowers.\n\nDurable Cedar Material: Crafted from pressure-treated cedar, this garden walkway path is built for long-term outdoor use, featuring excellent weather resistance and a non-slip surface to prevent accidents in wet conditions.\n\nSpace-Saving Design: The rollable design of this garden walkway allows for easy storage and quick setup. It can be expanded or combined as needed and is easy to clean with just a rinse of water.\n\nVersatile Usage: Suitable for various surfaces, this roll out wooden walkway is perfect for gardens, patios, beaches, and more, making it ideal for outdoor events like parties, weddings, and camping.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZWMzYmQ3ODU2ZGE0Mjc1YjhiNmNiMTkyMjA4MDg1ODZmMDJhZWMxZWUzNDg4OGFjOWViNWFjZTY5YWJhMTAyMy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=f659e06bc549bade6e0ddccc55baf48914484e0bc7bbd50c428e328ee87714b4"
    ],
    "url": "https://www.adverts.ie/other/8-ft-l-x-17-in-w-curved-wooden-garden-pathway-roll-out-garden-walkway/37422129"
  },
  {
    "title": "Electric Hoist Support Arm, 300 kg Max Load Capacity, Electric Hoist Holder Swing Arm with Pole",
    "price": "€225",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nHigh Load Capacity: Our hoist support arm effortlessly handles weights up to 661.39 lbs (300 kg), while the extended small square tube supports loads up to 330.69 lbs (150 kg). The capacity ensures stability and security in the workspace, thus enhancing efficiency when handling heavy equipment or materials.\n\nIndustrial-Grade Material: Crafted from industrial-grade carbon steel, our hoist arm boasts a sturdy triangular structure and advanced reinforcement technology. Its sleek surface coating stands up to moisture, while the thickened steel plate design minimizes swaying during use. Security latches keep all components securely in place for peace of mind.\n\nAdjusts to Your Needs: Enjoy the flexibility of 180-degree angle adjustment with this electric hoist support arm, expanding your operational range for smoother, more efficient lifting tasks. No more constant repositioning—get the job done with ease.\n\nConvenient Installation: Say goodbye to complicated setups! Our electric hoist arm can be assembled in minutes, and no special skills are required. Whether you're a pro or a novice, you'll be up and running in no time.\n\nVersatile Performance: From home renovations to warehouse operations and factory workshops to repair departments, our electric hoist swing arm is your go-to solution for lifting, moving, and more. Elevate your projects with confidence wherever you are.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZTk4ZGUxOGEwZTU4ZWFhNzNjZmZmOWEzNjhlMjE2Y2YyZjE3ZWM0ZTIyZjc2MzEyYzdhMzZlZmE4NjNiMmE1YS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=5f26998a3ee364218838b7f8648112a3ab2b56dacfcd65d6ef19e0acd85cc32d"
    ],
    "url": "https://www.adverts.ie/power-tools/electric-hoist-support-arm-300-kg-max-load-capacity-electric-hoist-holder-swing-arm-with-pole/37422095"
  },
  {
    "title": "Shaker Base Cabinet 24\" W x 19\" D x 32\" H Ready to Assemble with Drawer",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nQuality Wood: The ready to assemble cabinet features 24 W x 19 D x 32 H (inch) cabinet size and 44 lbs load capacity. The main structure is crafted from high-quality particle board, while the drawer is made of MDF, ensuring long-lasting durability. All exposed panels are protected by corner protectors and carefully packaged to protect the surface from scratches\n\nSoft Close Drawer: Equipped with a smooth sliding drawer, each with an internal dimension of 21.46 x 13.19 x 3.95 inch. The drawer opens and closes effortlessly, with soft-close slides that slow down the drawer when closing, reducing noise and shock. With straight pull handles for easy pulling, the white shaker cabinet is ideal for use in living rooms, offices, entryways, and garages\n\nEasy to Clean: The surface features 3M stickers, paired with finely crafted interiors to enhance the overall aesthetics and durability of the storage cabinet. It’s also easy to clean—simply use a soft cloth to maintain the surface. Avoid sharp objects that could scratch and damage the appearance of your base cabinet\n\nVersatile Storage: Featuring one drawer and two doors, with adjustable shelf for optimal organization. This design maximizes storage space for all your essentials, whether books, storage boxes, food, toys, or everyday items\n\nEasy to Assemble: Our unassembled cabinet is easy to assemble. The instruction manual is detailed, and each part is individually numbered for easy identification. The door direction is adjustable to suit your needs. The cabinet does not include a top surface",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMDA2ZmE4M2Q2MTFiODFlNzViYjM3ZmFmOGM3MmE5M2EzYmRjZDU2NGRhMDUwNmQ4OTJjMTkxNjYzMmRhODQyZi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=9dde2e511d20251e94425207ddab272ec5d0f890468fcc18284edd7650151f2c"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/shaker-base-cabinet-24-w-x-19-d-x-32-h-ready-to-assemble-with-drawer/37422054"
  },
  {
    "title": "Metal Raised Garden Bed 6.56x1.96x1.4 ft Galvanized Planter Box Dark Gray",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nCreate a Stunning Garden: Our 6.56 x 1.96 x 1.4 ft raised garden bed provides ample growing space for your plants. With a depth of 1.4 feet, it's perfect for various plants and vegetables to establish strong roots. Grow a variety of vegetables, fruits, flowers, and herbs in your garden, farm, field, or open area, and transform your space into a beautiful garden.\n\nSturdy and Durable: This metal raised garden bed is constructed with 0.4mm thick metal side panels. The surface is coated with galvanized powder for rust and corrosion resistance, ensuring long-term use in outdoor environments. The 8 internal X-shaped reinforcement bars provide extra stability, preventing the bed from toppling in strong winds. Get ready to tackle the outdoors with confidence!\n\nSecure to Use: To ensure your safety during use, our raised planter box features rolled edges with edge protectors to prevent hand injuries or scratches. Use with peace of mind and enjoy gardening effortlessly.\n\nEasy Installation: Equipped with complete screws and a pre-drilled design, you can quickly and easily assemble the raised bed by following the instruction manual. It only takes 15 minutes to set up with no extra tools required, making it perfect for gardening enthusiasts of all levels, including beginners.\n\nWhat You'll Get: Our raised garden bed includes 12 side panels, 8 cross bars, 12 edge protection strips, 74 galvanized screws, and a user manual",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNGM4YThiZDA3NWExYWVkY2VmM2Q1OGI3NzZhNjljZGVlYTNmZjZlNTZlNjNlNWRjMmNiOTJhNjA3NWQ4N2NjOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=e7020d6438ab5ce6f8dd65991c531e86d2318a33d941c325c212a77753ec637e"
    ],
    "url": "https://www.adverts.ie/other-fixtures-fittings/metal-raised-garden-bed-6-56x1-96x1-4-ft-galvanized-planter-box-dark-gray/37422018"
  },
  {
    "title": "Hay Spear 49\" Bale Spear 4500 lbs Capacity, Bale Spike Quick Attach Square Hay Bale Spears 1 3/4\" wide, Red Coated Bale Forks",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nDurable Quality: This hay bale spear is made of high-strength spring steel; it is sturdy and durable, with a bearing capacity of up to 4500lbs, and can be used to move any size of hay bales.\n\nSpecial Design: Our 49-inch hay spear went through special heat treatment. Thus it is not easily deformed. In addition, the spear's surface is powder-coated for corrosion-resistance.\n\nEasy to Install: Our bale spear can easily attach to and remove from the quick attach hookups and hitches the receiver of your equipment due to the convenient bolt and nut system.\n\nStrong Penetration: With its sturdy steel rod and sharp taper-shaped point, the hay bale spike can easily penetrate your bales without pushing them off of their stack and quickly getting out.\n\nWide application: Our hay bale spear is compatible with various implements, such as tractors, loaders, cranes, telehandlers, etc. It is a perfect tool for your farm work or agribusiness.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYTM3YTM4ZDYyMDgwMDAxMjhjMWM0OWY5N2JmNDYwYzEwZDU4NTllMzljN2Q5YzA2ODRlN2NkNGU5MGRkYjc1Yy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=bef6b2160ccc6c1783e47a66fcdcdf64389f8b22d9bb564e9d5e3ae17a31b06b"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/hay-spear-49-bale-spear-4500-lbs-capacity-bale-spike-quick-attach-square-hay-bale-spears-1-3-4-wide-red-coated-bale-forks/37421938"
  },
  {
    "title": "Portable Ice Maker Countertop, Bullet Ice Cube Machine, 9 Ice Cubes per 8 Minutes, Automatic Cleaning, Visible Window Scoop and Basket for Kitchen, Office, Bar, Black",
    "price": "€325",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nProduce 12kg of ice cubes every 24 hours, 9 ice cubes in 8 minutes\nIce making process within 15 minutes\nAutomatic cleaning function to clean itself\nWith LCD display screen\nThe top cover has visible window\nPortable design allows easy moving\nFits living room, kitchen, dorm, bar, and more\nAssembly required\nSpecification:\nColor: Black\nMaterial: PS, PP Plastic\nOverall Dimensions: 31.5L x 22.9W x 32.6Hcm\nIce Production: 12kg/day\nWater Tank Volume: 1.8L\nIce Tank Capacity: 0.8kg\nVoltage: 220V-240V/50HZ\nPower: 120W\nPower Cable Length: 1.8m",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzk5OTUyYTJlNzllYzM2NDhlYjgzNWM5NGZiMzc0ZGQxNzYzYTAwZDVlNmJlMzhjMmVkZDRlZGYwOGFkNGI0MC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=335c8034363f79347744e7aacc08dbc9144fd035a395b2d2eac0576dc1959881"
    ],
    "url": "https://www.adverts.ie/home-storage/portable-ice-maker-countertop-bullet-ice-cube-machine-9-ice-cubes-per-8-minutes-automatic-cleaning-visible-window-scoop-and-basket-for-kitchen-office-bar-black/37421925"
  },
  {
    "title": "Shoe Cabinet with 2 Doors, Open Shelf and Adjustable Shelves, Hallway Shoe Cupboard for 15 Pairs of Shoes, Entryway Storage Unit, Grey",
    "price": "€400",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nElegant shoe cabinet matches the home furniture of most styles\nParticleboard construction with steel legs makes it robust and solid\n4-tier cabinet and open shelf can store up to 15 pairs of shoes (The largest shoe size: UK 10)\nThe inside shelf is 3-level adjustable to satisfy shoes of different heights\nTable top with elevated panel protects your items from falling out\nOrganize your shoes in a neat way, suitable for entryways, hallways, or any narrow places\nAnti-tipping design and anti-slip foot pads ensure extra safety\nAssembly Required\nSpecification:\nColour: Grey, Gold Tone\nMaterial: Particle Board, Steel\nOverall Dimension: 60W x 33D x 100Hcm\nTop Storage Dimension: 57W x 30D x 5Hcm\nEach Inner Shelf Size: 57W x 31D x 14Hcm (middle level)\nOpen Shelf Size: 57W x 31D x 14Hcm\nStorage Capacity: 15 pairs of shoes (The largest shoe size: UK 10)\nWeight Capacity: 10kg (each shelf)",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNWNmZmM5M2M0ZGJjNjQ5NTRiNDA3NTE5NTMwZTJlYmNlZDA2MmFkODBmN2FkM2U2NzJmYmY3ODdlMGVhNGY4Ny5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=b81c91549667746c2268efaef1334de9e01e93e5b411913b4212c23076803198"
    ],
    "url": "https://www.adverts.ie/other-home-garden/shoe-cabinet-with-2-doors-open-shelf-and-adjustable-shelves-hallway-shoe-cupboard-for-15-pairs-of-shoes-entryway-storage-unit-grey/37421900"
  },
  {
    "title": "Set of Two Marble-Effect Stacking Tables - Wood Grey",
    "price": "€225",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nModern elegance 2 pcs coffee table set featuring cement ash tabletop and black steel base\nAll-match indoor decor fits living room, bedroom, dorm, office, conference room, reception\nStack together for saving space or use it independently\nVersatile furniture can served as end side table, tea coffee table, night stand or corner table\nMDF board tabletop provides high load capacity\nQuality steel base offers safe standing on the floor\nFoot pad design can well prevent the ground scratches\nRequires simple assembly\nSpecification:\nColor: Grey, Black\nMaterial: Steel, MDF Board\nOverall Dimensions: 78.5L x 78.5W x 46.5Hcm(big), 59L x 59W x 36.5Hcm(small)\nWeight Capacity: 50kg",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMjZjZWQ4NDM5Zjg0Y2VhZDI0OTc3NGMxMWRmZmJmZDRkNDRlNjgyYTU2ZTFkNWRhZmI0ZWVkODJhY2Q3YTRlOC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=a53028edae0d838966448badfd486d1a815675a9b640fc4d9f1f46e1390559e9"
    ],
    "url": "https://www.adverts.ie/other-health-beauty/set-of-two-marble-effect-stacking-tables-wood-grey/37421880"
  },
  {
    "title": "TV Cabinet Stand Unit for TVs up to 50'' with Foldable Drawers, Entertainment Centre for Living Room White",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nWhite and grey colourway is neutral and modern for the home and office space\nTwo removable drawers and two shelves for storage. Flat table top suitable for TV and monitors\nFabric drawers easy to maintain - can be taken out too for extra and freestanding storage\nCable holes on back to group together safely\nFive wooden legs for support, angled for balance\nAssembly required\nSpecification:\nColor: White, Grey\nMaterial: MDF, Non-woven Fabric\nOverall Dimension: 110W x 29D x 46.5H cm\nDrawer Inner Size: 33W x 26.5D x 27H cm\nOpen Shelf Size: 35L x 27D x 14H cm (each tier)\nLeg Height: 15 cm\nWeight Capacity: 40 kg (total), 3 kg (drawer), 5 kg (shelf)",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiODYxNWY4ZjkxYTFmYTgwNTBiMjllOGQxMTgxZDk2YzI3OWQ0NjM0NjdjMGU0MTQ5OWY3NTY0MGM0ZjFkNjA0ZC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=9db5ef807acdb058422390a54a7612349f5a7aa5ffceec97585dd071bca299c4"
    ],
    "url": "https://www.adverts.ie/other-home-garden/tv-cabinet-stand-unit-for-tvs-up-to-50-with-foldable-drawers-entertainment-centre-for-living-room-white/37421853"
  },
  {
    "title": "Set of 2, Height Adjustable Swivel Barstools, PU Leather Upholstered Bar Chair with Backrest, Armrests and Footrest",
    "price": "€385",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nFit Bar Table Height of 92-102cm\nSeat height is adjustable from counter height to bar height\n360-degree swivel design to chat with others or leave the seat conveniently\nCushioned seat and back provide optimal comfort\nThe footrest helps in keeping a relaxed body posture\nPowder-coated steel base for strength and support\nAssembly required\nSpecification:\nColour: Light Grey, Black\nMaterial: PU, Sponge, Steel\nOverall Dimension: 57W x 50D x 84-104H cm\nSeat Size: 41W x 40D cm\nSeat Height: 62-82cm\nBackrest Height: 25cm\nFootrest to Floor: 22.5-42.5cm\nBase Dimension: Φ45cm\nWeight Capacity: 110kg",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOWVhYjJkMDIxMjlhZjUwMWRjOTFkYjcyNjc0ZWJlOWQzMjUxNGEwYzVjZjYxYWMwNDJmMTRiYjBjMzE5MmNlMi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=3bb968845714f98d78965e846abe40b576d7f72efbd0c215d52dc28d799f37f0"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/set-of-2-height-adjustable-swivel-barstools-pu-leather-upholstered-bar-chair-with-backrest-armrests-and-footrest/37421844"
  },
  {
    "title": "75x60cm Freestanding Bathroom Storage Cabinet Unit w/ 2 Drawers Cupboard Adjustable Shelf Metal Handles Traditional Style",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nThe clean colour finish is versatile\nMDF construction, structure is solid and durable\nWater and moisture resistant paint all over for suitability in the bathroom\nFeatures a cupboard and two drawers, giving you lots of storage space\nAdjustable shelf in cupboard to suit you\nAnti-tipping straps on back, safe in homes with children and pets\nAssembly Required\nSpecification:\nColour: White\nMaterial: MDF\nOverall Dimension: 75H x 60L x 30Wcm\nDrawer Inner Size: 7.5H x 22W x 24.5Dcm\nCupboard Inner Size: 51.3H x 53.8W x 26Dcm\nWeight capacity: Whole: 24kg. Tabletop: 10kg. Shelf: 5kg. Drawer: 2kg",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZGYyYWY0ZDY3YzUwODc0ZmVkZjJlODUwMzg0MGFhMzY0ZjY0NTllZDVmOWM4Y2QzOGUwYWMxYTNiODdjMGQyMi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=4f2c1275c512dcd40b080354abca3fe70bd7a9ea67e47673e4a864c90312e95c"
    ],
    "url": "https://www.adverts.ie/other-home-garden/75x60cm-freestanding-bathroom-storage-cabinet-unit-w-2-drawers-cupboard-adjustable-shelf-metal-handles-traditional-style/37421824"
  },
  {
    "title": "Artificial Decorative Wreath 19 in Pink Peonies Hydrangeas Year Round",
    "price": "€85",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\n1:1 Replica Flower Design: This decorative wreath features a 1:1 replica flower design, full and lush, with each peony, hydrangea and leaf exquisitely crafted to be lifelike. The colors are vibrant and the details are finely done, creating a realistic appearance.\n\nPremium Silk Fabric: This all-season wreath’s flowers have vibrant, long-lasting colors. The material is durable, easy to clean, and fade-resistant, making it suitable for long-term use. It is soft and realistic in appearance.\n\nVersatile Decoration: This front door wreath is ideal for various settings—whether for home decor, holiday celebrations, wedding arrangements, or commercial space beautification. It adds a natural, elegant atmosphere to any occasion.\n\nIdeal-Sized Wreath: When fully expanded, the faux wreath measures approximately 19 in in width. Whether hung on a front door, wall, outdoors, indoors, windows, fireplaces, or tabletops, it adds natural beauty without overwhelming the space.\n\nEasy to Hang: With just a few minutes of simple arranging, you can create an excellent indoor wreath. Hang it with a single nail to easily place it on a porch, fireplace, wall, or anywhere else as home decor",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYWUyNzFiYmNmOWJhNDkwNmQ2NzkxZmZmYjAyNzJkN2Y5OGM5NTIwY2M1MDA1MjVlZmI4MWY5NmU1YzMzMDA1Ni5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=05082b025b733c082b4b1a8f8359765eed84e2fb6cc5a7f2dbb953c872ec42da"
    ],
    "url": "https://www.adverts.ie/flowers/artificial-decorative-wreath-19-in-pink-peonies-hydrangeas-year-round/37421806"
  },
  {
    "title": "Carpet Floor Sweeper Manual 170mm Width Sweeping Paths Purple",
    "price": "€75",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nQuick & Quiet Cleaning: This carpet sweeper operates without electricity or batteries. Simply move it back and forth, and it will effortlessly sweep up dirt into its built-in dustpan without disturbing the peace, ensuring surfaces are left impeccably clean with minimal effort\n\nClean Like a Magnet: The carpet sweeper manual push is equipped with a roller brush that acts like a magnet, efficiently picking up garbage and dust. With its four-wheel design, it moves freely both forward and backward, making cleaning a breeze\n\nEasy to Empty Garbage: Our manual sweeper is incredibly easy to empty! Simply pull up the clasp, and everything you've swept up effortlessly falls out, keeping your hands clean. Plus, we've included a small cleaning comb to help you get rid off any hair caught in the brush\n\nUser-Friendly Design: With a 180-degree rotating head, this floor sweeper manual is designed to effortlessly clean hard-to-reach areas under coffee tables, sofas, and even beds. Its extended handle wipes out the need to bend over while cleaning\n\nVersatile Applications: Our lightweight manual carpet sweeper effortlessly glides across any surface, attracting and collecting dirt, crumbs, nut shells, animal hair, and debris from hardwood, laminate floors, tiles, carpets, and rugs in mere seconds! It makes cleaning easier than ever before",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzhmNmZlZTU0YzJhYjVlZmRhMGEwZGU1NzcwNTg5OWJkODgwNzA1MDFhYWJlNmU0YmZjM2Q3ZDdkNWFmZTc4NS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=e6c42e02c91aa47ff2abf69ed53c4504c4233a29ae76a7f2bd95263fd25b964e"
    ],
    "url": "https://www.adverts.ie/other-home-garden/carpet-floor-sweeper-manual-170mm-width-sweeping-paths-purple/37421792"
  },
  {
    "title": "Step and Repeat 8'x8'- 10'x8' Backdrop Banner Stand Adjustable Telescopic Height",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nStable Aluminum Stand: This 8 x 8 ft banner stand comprises 0.05\"/1.2 mm thickened aluminum poles, providing sturdiness and rust resistance for long-term use. Its standing iron feet give firm support with a strong loading capacity of 4.4 lbs/2 kg, suitable for different kinds of backdrops.\n\nAdjustable Display Size: The backdrop frame features a telescopic design with adjustable width of 5.6-10 ft/170-300 cm and an adjustable height of 3.6-8 ft/110-240 cm. All poles are easily retractable by loosening the joints, convenient to fit for banners or posters in different sizes.\n\nSet up in Minutes: Our backdrop stand is easy for one person to assemble and disassemble in a few minutes. No professional installers or additional tools are required. You only need to install bases with equipped screws & wrench, connect pole sections, and adjust the frame to the required size.\n\nEasy Storage & Carrying: The backdrop stand for parties comes with a carry bag to ensure everything is in order. Oxford fabric material and strong bag strap make it durable and dust-proof. With 13.2 lbs/6 kg weight and this storage bag, you can quickly bring the kit to any occasion.\n\nMultipurpose Use: Backdrop stand heavy duty is designed to hold large graphics in photography display & exhibitions, support office plastic shields to keep hygienic, or as a photo booth background. It's widely used in holiday events, conferences, shopping malls, weddings, etc.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYTBhZmQyMjA2OTEzYTMzZjIzM2I0YTU1NmQ0Njc3ODE3MjM4NDZjOGVhMGNlZGJhMDE2NTcyMGIyZWJlM2M5Zi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=2b9203233c539672b2aa65d4ae43cc2ce42b501357e51d6517f1f4fc1faa1f91"
    ],
    "url": "https://www.adverts.ie/business-shop-fittings/step-and-repeat-8-x8-10-x8-backdrop-banner-stand-adjustable-telescopic-height/37421761"
  },
  {
    "title": "13 x 11ft Outdoor Garden Roofed Metal Storage Shed Tool Box with Foundation Ventilation & Doors, Grey",
    "price": "€1,100",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nFeatures:\n\n24.5m³ sizing is spacious enough for storing all your outdoor tools, equipment and gardening gear\n\nMade from galvanised steel with a protective top coat for durability and protection against outdoor elements\n\nSliding double door for easy access\n\nSlopped roof for the water to roll to floor, preventing build up and rust formation\n\nFour ventilation holes provide aeration inside, preventing mould and mildew build up\n\nFloor foundation included, with all parts pre-cut and pre-drilled\n\nplease use gloves when installing\n\nAssembly required\n\nSpecification:\n\nItem Name: Garden Shed Storage\n\nBrand Name: Outsunny\n\nColour: Grey\n\nMaterials:0.25mm Galvanized Colour Steel, Polypropylene (PP) Plastic\n\nOverall Dimensions: 340W x 382D x 200Hcm\n\nDoor Size:138W x152Hcm\n\nWall Height:155cm\n\nCapacity:24.5m³\n\nNet Weight:117.5kg\n\nFlat Pack: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYThhNTQ5ZDQxMzZjYjAzYWY2MzAyOWEyY2RmMmJmNzk2MGQyOTJkMTliOGY4OGY4NThjMmVhYThiYTMzYjA2ZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=87c96e4b960f33d4f6b2a19ec4fa352fe592be107c029bb922f0a52f6d25accb"
    ],
    "url": "https://www.adverts.ie/camping-equipment/13-x-11ft-outdoor-garden-roofed-metal-storage-shed-tool-box-with-foundation-ventilation-doors-grey/37335526"
  },
  {
    "title": "Outdoor Storage Shed, 7ft x 4ft, Large Patio Roofed Tool Metal Storage Building Foundation Sheds Box Outdoor Furniture",
    "price": "€550",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nFeatures:\n\nLarge and spacious design to store all your outdoor tools, equipment and gardening gear\n\nMade from galvanised steel with a protective top coat for durability and protection against the outdoor elements\n\nSliding and lockable double door for easy access\n\nSlopped roof for the water to roll to floor, preventing build up and rust formation\n\nFour ventilation holes ensure aeration inside, preventing mould and mildew build up\n\nFloor foundation included for an even structure on the ground\n\nAssembly required, please use gloves when installing\n\nSpecification:\n\nItem Name: Garden Shed Storage\n\nBrand Name: Outsunny\n\nMaterial: Colour plate, polypropylene\n\nColour: Khaki\n\nNet Weight: 44kg\n\nOverall Dimension: 213L x 127W x 185H (cm)\n\nRoom Interior Dimension: 203L x 117W x 185H (cm)\n\nWall Height: 155cm\n\nSliding Door Size: 96L x 152H (cm)\n\nPerspective Window Size: 21.8L x 9.8W (cm)\n\nColour Plate: 0.025cm thick\n\nFlat Pack: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzQwYTc1NDE1YWE2NDU4MDY2ZGJiZmIwNWFhYmY3OTEwMmMzOGIzYWY5Yzk0YjlhNzhiNjAwYWJkMWMyYTM4NS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=81e6769ad9b22333bfa5b80e0a6146697234edaf8a7bbd5eda9a33a3a6e9ac0b"
    ],
    "url": "https://www.adverts.ie/hand-tools/outdoor-storage-shed-7ft-x-4ft-large-patio-roofed-tool-metal-storage-building-foundation-sheds-box-outdoor-furniture/37335561"
  },
  {
    "title": "Rugs Living Room Large 200x290 Cm - Grey Area Rugs for Bedroom Anti Slip - Super Soft Fluffy Shaggy Rug Thick Pile Non Shedding",
    "price": "€185",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nSize\n\n200 x 290 cm (Rectangular)\n\nMaterial\n\nFaux Fur, Fur, Polyester\n\nWeave type\n\nNO\n\nItem weight\n\n3470 Grams\n\nPile height\n\nHigh Pile\n\nUPGRADED DESIGN: Large super soft fluffy rug carpet runner mat, with a quality high density pile, ready to unroll for any room and provide the finishing touch. It's super soft and smoothing to provide exceptional comfort, also a best choice for yoga and indoor activities. The area rugs is suitable not only for your master bedroom, living room or dining room, but also the nursery room, children's Room, baby's room, lounge and kindergarten. Add modern style to any room.\n\nDURABLE SHAGGY RUGS WITH NON SLIP BOTTOM: This carpet Material is high quality Polyester, with this cozy and comfortable faux fur rug, create an inviting space and a restful feeling in the bedroom, promote a warm, luxury and cozy ambiance. Superfine fiber, extremely soft fabric, no shedding no smell, the area rug to give vibrant color and soft texture to your room. And the non-slip bottom design to keep the rug as far as possible stay in place.\n\nSOFT AND FLUFFY LIKE PICTURE: Super soft feeling protects the toes from cold and hard floors, give your feet the gift of exceptional comfort and massage feeling. Absolutely finest quality, thick and very good looking like the picture. The luxuriously soft, textured shag pile offers comfort underfoot and the modern, simple yet stylish design will accommodate any space.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNmIwNWRhMjgzODRhZDYwYzBiNzc1NTlkNzZjZDEwM2IxODJlYTgxN2M2ODUyMzgyYjg1MTBlODY2NzM1MTlkZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=112b64f9d1410ab12234d514a2e91b82f0bf0f2ceef9d4dcd0c5edd82a61393c"
    ],
    "url": "https://www.adverts.ie/rugs/rugs-living-room-large-200x290-cm-grey-area-rugs-for-bedroom-anti-slip-super-soft-fluffy-shaggy-rug-thick-pile-non-shedding/37413243"
  },
  {
    "title": "Rugs Living Room Large 200x290 - Machine Washable Rug - Area Rugs for Bedroom - Large Boho Rug Vintage Rugs Anti Slip Fluffy Carpet for Living Room, Bedroom",
    "price": "€185",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nSize\n\n200x290cm\n\nMaterial\n\nFaux Wool\n\nPile height\n\n0.5 centimeters\n\nConstruction type\n\nMachine Made\n\nColour\n\nRetro Red\n\nWarm Tips: The bedroom rug comes folded in the package, you can use an iron to remove the creases and it will be a great rug in just 24 hours.\n\nSoft Low Pile Faux Wool Rug: Washable Rug measures 200x290 cm and is 0.5cm thick. This abstract rug can be easily placed in entryways and under furniture without getting caught in doors and becoming a tripping hazard.\n\nMachine washable Rug: Our living room Washable Rugs is a machine washable carpet. You only need to roll up this bedroom carpet and throw it into the washing machine for cleaning, which is very convenient. Bohemian rugs can also be cleaned with low-power vacuum wipes or a vacuum cleaner.\n\nNon-shedding and non-slip: The short-pile carpet will not shed, and the rubber bottom of the carpet enhances grip and prevents slipping when walking on the running carpet. The large rug is non-slip, waterproof and fade-resistant. durable.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOWE4MmY2ZDE3YzNlOWIwMzM1NzU4NWY3MmVmNWYyODFhMDJlODVkMGMwMGNjYzc0YmJhNzU2NjI3MjM2OWM1MS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=cfaa0109be5515566dff0e465180f9822d9d0bdf82eba085ea3ccf0663489fb6"
    ],
    "url": "https://www.adverts.ie/carpets/rugs-living-room-large-200x290-machine-washable-rug-area-rugs-for-bedroom-large-boho-rug-vintage-rugs-anti-slip-fluffy-carpet-for-living-room-bedroom/37413223"
  },
  {
    "title": "Executive Office Chair with Footrest - Ergonomic High Back Design, Thick Bonded Leather Computer Chair with Removable Lumbar Pillow, Recliner Gaming chair for Home Office Work Comfort (Black) 50+ bought",
    "price": "€375",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nColour\n\nBlack\n\nMaterial\n\nLeather\n\nProduct dimensions\n\n74D x 68.5W x 120.5H centimetres\n\nSize\n\nOne Size\n\nItem weight\n\n22.5 Kilograms\n\n【Luxurious Bonded Leather】Experience the epitome of comfort with our executive desk chair crafted from high-quality bonded leather. Resistant to scratches, stains, peeling, and cracking, this boss chair boasts a luxurious feel. Padded linkage armrests and an elegant design make it the perfect addition to your home or office.\n\n【Ultimate Ergonomic Support】Our ergonomic office chair is thoughtfully designed with double padding all around, a high backrest, widened sides, and a removable lumbar support pillow. This comprehensive support system wraps around your body, allowing you to sit comfortably for extended periods. The retractable footrest adds extra comfort and leg support, making it ideal for napping.\n\n【Premium Seating Experience】Indulge in a certified seating experience with carefully selected and perfectly finished components. The computer chair features an extra-thick, large cushion (21\"W x 18.7\"D, 5.51\" Thick) to enhance your sitting experience. Say goodbye to pain and fatigue during long hours of gaming or working.\n\n【Upgraded and Fully Adjustable】Embrace the newly upgraded office chair with an eye-catching outlook, perfect for your work-from-home setup. Adjust the seat height between 19.69\"-22.83\", and enjoy rocking from 90°-135° with the pull of a lever. The convenient footrest and heavy-duty metal base ensure a comfortable sitting experience under various conditions, supporting up to 300 LBs.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNmFkY2JiZTdhYjU5NzFiMjgxMjRiM2U1Y2Y5YzM4MDlkYTcyYTk3MTQ1YjQ2NTRmMDFjOWJiZGUxNjNlZTNkMy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoxNTEsImhlaWdodCI6MjkyfX19?signature=6d28df30008f16958e126ec47a1ab59444da02fe6e31d6e34314137a421f4897"
    ],
    "url": "https://www.adverts.ie/office-tables-chairs/executive-office-chair-with-footrest-ergonomic-high-back-design-thick-bonded-leather-computer-chair-with-removable-lumbar-pillow-recliner-gaming-chair-for-home-office-work-comfort-black-50-bought/37413209"
  },
  {
    "title": "Ergonomic Office Chair - High back mesh design, adjustable lumbar support and headrest, reversible armrests, comfortable",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nColour\n\nBlack\n\nProduct dimensions\n\n62D x 28W x 58H centimetres\n\nItem weight\n\n10.8 Kilograms\n\nBack style\n\nSolid Back\n\nFrame material\n\nAluminum\n\n【Mesh Computer Chair】This Mesh Computer Chair, even if you need to sit for a long time, the leg pressure is very small, and it can also protect the back spine. Matched with high-density foam padding, it is soft and not easily deformed\n\n【Multi-Adjustment】With adjustable headrest, adjustable backrest and armrests . The height of the seat can also be easily adjusted as needed, from 16.1 inches to 19.2 inches to suit different body shapes. This executive swivel chair can provide you with a customized seating experience\n\n【Breathable Mesh Backrest】The high-grade backrest of mesh fabric is flexible. The mesh office chair gives you a cool feeling and a comfortable sitting posture, promotes good air circulation, eliminates sweat and moisture, and allows you to concentrate and relax at the same time\n\n【High Quality】The chair is made of high-quality materials. Our ergonomic office chair can support a maximum weight of 150 kg, 330 lb, providing high safety and stabilit",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNmFkY2JiZTdhYjU5NzFiMjgxMjRiM2U1Y2Y5YzM4MDlmYmFkZTAxNTA0MWNjOWUzN2QwYThkOWMyMmVjOTNiYS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoxNTEsImhlaWdodCI6MjkyfX19?signature=5e013184eef43b449881fb3164e794663452aa9892e651205a24dc7ab0ee7172"
    ],
    "url": "https://www.adverts.ie/office-tables-chairs/ergonomic-office-chair-high-back-mesh-design-adjustable-lumbar-support-and-headrest-reversible-armrests-comfortable/37413191"
  },
  {
    "title": "Xtreme Cooler Box | Large High-Performance Ice Box | PU Full Foam Insulation | Stays Cool for several Days | Portable Cool Box | with handles & wheeles",
    "price": "€200",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nColour\n\nBlue\n\nMaterial\n\nHigh Density Polyethylene (HDPE)\n\nPackage information\n\nBox\n\nCapacity\n\n48 litres\n\nProduct dimensions\n\n66D x 42W x 38H centimetres\n\nLARGE CAPACITY: With a 49-liter capacity, the cooler box offers enough space to keep bottles, cans, BBQ food, snacks, and more, cool and fresh for days; outlet valve for easy draining of melted ice\n\nHIGH-PERFORMANCE COOLING: Through high-quality PU full foam insulation, including in the lid, the insulated box keeps drinks and food cold for up to 4 days; perfect for camping, picnics and festivals\n\nDURABLE MATERIALS: The ice box is made from tough HDPE plastic and impresses with its stylish design; sturdy handles on each side make transporting the box easy\n\nEXCELLENT FEATURES: Thanks to its robust design, the cooler can also be used as a seat; the lid also features recesses for securing cans and bottles\n\nDimensions: inside 47 x 31 x 38 cm, outside 56 x 42 x 47 cm; weight: 5.5 kg; cooling time: up to 4 days; max. seat weight: 113 kg; capacity: 49 L; outer material: HDPE plastic; full foam insulation",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMmZlYWE0ODA5YTk1ZjkyOTFkZGJhNjYwYzcwMDUwY2FmNzU1MmUyZjU3M2FiMmEwMzlkOTQ3MzRkY2NkYzM4Ny5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozNTAsImhlaWdodCI6MjQ0fX19?signature=a3cbc22000de1dcaef3f9c707cac88dd4e860a46a294efea926e24a480fae0cb"
    ],
    "url": "https://www.adverts.ie/small-kitchen-appliances/xtreme-cooler-box-large-high-performance-ice-box-pu-full-foam-insulation-stays-cool-for-several-days-portable-cool-box-with-handles-wheeles/37413092"
  },
  {
    "title": "Camping Tent, 3 Man Pop Up Tent Extra Large Waterproof Automatic Dome Tent with 2 Rainproof Windows, 2 Layers Family Festival Tent",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nTop highlights\n\nBrand\n\nYafaca\n\nProduct dimensions\n\n2.1L x 2.1W x 1.4H metres\n\nItem weight\n\n4.3 Kilograms\n\nFloor width\n\n7 Feet\n\nRecommended uses for product\n\nCamping\n\nShape\n\nRectangular\n\nEasy Set Up or Fold in Minutes: With the automatic hydraulic system, you can easily set up or fold the camping tent within a minute. Then you can spend more time enjoying your outdoor activities rather than setting up your tent. The carbon brazed support structure, 12 steel stakes and 8 wind ropes ensure the long-term durability and stability of the pop up tent.\n\nAll Around Waterproof Tent: The double-layer camping tent is made of 210D polyurethane coated polyester PU 3000mm special waterproof coating material, and the bottom is made of durable 210D PU 5000mm oxford material. In addition, there is waterproof tape on each seam and zipper to ensure that campers can stay dry even in inclement weather conditions.\n\nUnique Rainproof Window Design: The tent features 2 unique window that offers excellent ventilation, helping to maintain a comfortable temperature inside the large tent, regardless of the season. On rainy days, you can open the window to breathe fresh air. On good days, you can fully roll up the window to enjoy the scenery outside. And you can also close the window to protect your privacy.\n\nSuper Large Space for 3 Persons: Camping tent size: 83 x 83 x 55 inches. We increased the tent space by at least 30%. The upgraded large tent is spacious enough to accommodate at least 3 adults, making you feel as comfortable as at home. After folding, the family tent size is only 32 x 7 x 7 inches and weighs 9.7 lb, making it very convenient to carry.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYWQ2N2RkMmMxODdkYjVhYzk3NTE0ZjZlYmZmYjk3MTJiM2U0ZGQ2OTZjNjU0OTA2ZDIwYTY2YWQ3OTk4Y2Y1OC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6MjI4fX19?signature=182bc8c3b3c81a294f2ccb906c34f959c114247b3a014be09ec4e749fbfb2952"
    ],
    "url": "https://www.adverts.ie/camping-equipment/camping-tent-3-man-pop-up-tent-extra-large-waterproof-automatic-dome-tent-with-2-rainproof-windows-2-layers-family-festival-tent/37413074"
  },
  {
    "title": "SUV Tent - 300 x 300 x 210 cm, Universal 4 Person Vehicle Tent with Waterproof Rainfly, Suitable for Family Camping and Outdoor Activities",
    "price": "€500",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nProduct dimensions\n\n3L x 3W x 2.1H metres\n\nItem weight\n\n8.8 kg\n\nFloor width\n\n3 Metres\n\nRecommended uses for product\n\nTravelling, Picnic, Camping & Hiking\n\nShape\n\nSquare\n\nWaterproof & Windproof —— 210T PU2000mm ripstop polyester for rainfly and tent wall to prevent raining drops, 210D PU3000mm oxford polyester for bottom to keep water out. Each stitch has been covered by waterproof band. Four corners of the tent can be tied to the ground with wind ropes, to prevent windy day!\n\nGood Ventilation —— Double large doors and a wide window, easy to come in and out. All the doors and window has high quality net mesh to allow air goes in while keep insects out, providing a wide view for your vacation!\n\nQuick Set Up —— A perfect tent can only be set up in a few minutes. This car tent has a cross bar structure on the top, which is very universal type and easy to set up.\n\nLarge Interior Space —— The large interior space can accommodate whole family playing, picnic, resting and sleeping. It is 3m x 3m large ( 10 x 10 ft ), 2.1m (7ft) high. You can put your luggage on your car trunk and take things at any time!\n\nConvenient to Travel —— The polyester tent is 8.8kg (19.4 lbs) only! And it can be packaged in a small size of 65 x 23 x 20 cm ( 25.6 x 9 x 7.8 inch ), which makes it easy to carry",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOGQwYjNiOThkM2ZiZDViYTFiNmJmZGM3MWYwMzg4YThmNTkwMjFmNGU0MWRjZGU1MjM2YjhiOWRiODc5MGI4Yy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6MjAxfX19?signature=33da9b35995a15534d99000116e63b88c4decf064863081ca7ecca00fd27e075"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/suv-tent-300-x-300-x-210-cm-universal-4-person-vehicle-tent-with-waterproof-rainfly-suitable-for-family-camping-and-outdoor-activities/37413059"
  },
  {
    "title": "Pop Up work shelter Gazebo 2mx2m small event shelter party tent garden bbq Fishing camping/Trade Shows/Temporary",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nMaterial\n\nPolyester\n\nColour\n\nwhite & yellow\n\nItem weight\n\n6 Kilograms\n\nRecommended uses for product\n\nFishing,Camping\n\nProduct dimensions\n\n2L x 2W x 2H metres\n\nFolding design allows you to free storage in the car behind. Only 6.5 kg weight, can easily lift to the place where you want to stand up. Space:2.2m×2.2m×2m(7.2ft×7.2ft×6.6ft),Large interior space to provide you with rest or other entertainment.\n\nThe place is more useful than you think,Can be used on Grass, Concrete, patios, construction site,Advertising,Fishing Tent,Decking, to carry out temporary work and services to the Telecommunications, Fusion/Electrical Jointing, Utility, Roadworks and Emergency Service sectors to provide very quick temporary shelter where time is valuable.\n\nHigh-quality Oxford cloth, able to withstand greater water pressure and wind resistance.\n\nInstant pop up design,Tents can be quickly and completely assembled and dismantled without worrying about spending more time.\n\nfor garden bbq/camping / barbecue / work tents / Event Shelters / Temporary erection of constructions sites or telecommunication works （There is a video provided on the product page for installation and use, you can click to view it",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZTM1Njc3ZjEwNDFjYjNkN2U0MzI4MTMyYmZkMTJmYzkzN2Q4M2I0M2ViN2VlOGI3OTBjMjg0NmRlNTA2MjI0OC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozOTYsImhlaWdodCI6Mjg1fX19?signature=7fbeeedb3e758a1a08b7ed567da390ea52b0261793a7ce6c917500792f1e57f6"
    ],
    "url": "https://www.adverts.ie/other-home-garden/pop-up-work-shelter-gazebo-2mx2m-small-event-shelter-party-tent-garden-bbq-fishing-camping-trade-shows-temporary/37413037"
  },
  {
    "title": "Multi Function Weight Bench Professional Gym, 1000 Foldable with Barbell Rest Butterfly and Leg Curler | Weight Station Training Bench Incline Bench Flat Bench",
    "price": "€275",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nItem weight\n\n19 Kilograms\n\nBrand\n\nArtSport\n\nColour\n\nBlack\n\nMaterial\n\nAlloy Steel\n\nProduct dimensions\n\n154D x 118W x 102H centimetres\n\nTension level\n\n100 kg\n\nMultifunction: The weight bench is a real all-rounder. Whether it is sit-ups, butterfly, bench press or leg curls – the training bench offers you a variety of possibilities.\n\nFull body training: With the incline bench you can effectively strengthen numerous muscles at home. Abdomen, legs, biceps, chest, back, shoulder or triceps - you can train your entire body.\n\n Backrest can be adjusted to 4 different positions: The backrest can be adjusted in 4 different positions. Easy-care PVC leather pads provide great comfort during strength training.\n\nShelf with safety bracket: The barbell can be placed on the barbell rack during training breaks. Safety bars secure the dumbbell after training.\n\nFoldable and space-saving: The flat bench can be folded up in a few simple steps and stowed away to save space. Ideal for home gym",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiODlkMjE1MjEzOTI3NTZmODYxYjljY2UxYmU2MTliMWI2YTUwYTFhOGZhMDQ5MWVkNzI3YTZhMGU4ZDNhOGY3Yy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=1e9c98ddfbb006ca63aab21a403d6be20fcbd49a95666f27fff82750c6c62424"
    ],
    "url": "https://www.adverts.ie/benches/multi-function-weight-bench-professional-gym-1000-foldable-with-barbell-rest-butterfly-and-leg-curler-weight-station-training-bench-incline-bench-flat-bench/37413033"
  },
  {
    "title": "Fry Max Digital Air Fryer, 5L, 10in1, Uses No Oil, Air Fry, Extra Crisp, Roast, Bake, Reheat, Dehydrate, 6 Portions, Non-Stick",
    "price": "€150",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nSpecial feature\n\nTemperature Control\n\nProduct dimensions\n\n37.5D x 27.3W x 32.4H centimetres\n\nColour\n\nBlack\n\nCapacity\n\n5 litres\n\nMaterial\n\nPlastic\n\nRecommended uses for product\n\nRoast, Bake, Reheat\n\nHEALTHY MEALS IN NO TIME: Discover Easy Fry Max, an essential air fryer that produces healthy and delicious meals in no time with little or no added oil\n\nCOOK FOR THE WHOLE FAMILY: The generous 5 L capacity serves up to 6 people—enough for even the hungriest of families and ideal for special occasions hosting guests\n\nSAVES ENERGY: Tefal Easy Fry Max saves up to 70% more energy with 46% faster results* for easy home cooking (*external test, carried out on 800 g of french fries, compared to a Tefal convection oven)\n\nAUTO COOKING PROGRAMS: Discover monitor-free cooking that comes out perfect every time with 10 cooking presets: Fries, Chicken, Steak, Fish, Dessert, Pizza, Nuggets, Vegetables, Shrimp and Bacon\n\nDIGITAL TOUCHSCREEN: An easy-to-use appliance equipped with an intuitive digital control panel that takes the hassle out of home cooking",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYjYwMDMxYjA2ZTE3ZDZiYTdlYjAwZDNjYjhjMmQ4YmZmNTkyYmQ3ODI2YzAwOThmMWNlYTVlZjdjMzlkM2ZlMy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyODAsImhlaWdodCI6MjkyfX19?signature=3383f4b228e45130d9608536a58498d4f8de829c4b0de0b8b777afb6d1655ec4"
    ],
    "url": "https://www.adverts.ie/other-home-garden/fry-max-digital-air-fryer-5l-10in1-uses-no-oil-air-fry-extra-crisp-roast-bake-reheat-dehydrate-6-portions-non-stick/37412999"
  },
  {
    "title": "4-Panel Room Divider Anthracite 346x180 cm Fabric",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nDescription\n\nThis room divider can divide a room into several parts to provide a private space and protect your privacy.\n\nDurable material: The fabric features a simple and clean look, and is breathable and durable.\n\nVersatile function: You can not only use the room divider screen to separate the bedroom, or block part of the room as needed, and also place it on the side of the window to block direct sunlight. Of course, you can even use the screen as a background wall.\n\nFoldable design: This 4 panels room partition is foldable, so it's easy to store without taking up much space.\n\nGood to know:\n\nEach product comes with an assembly manual in the box for easy assembly.\n\nThis room divider fabric allows some light to filter through, so it doesn't completely block all the light.\n\nSpecifications\n\nColour: Anthracite\n\nMaterial: Fabric (100% polyester), iron\n\nOverall size: 346 x 180 cm (W x H)\n\nEach panel size: 83 x 161 cm (W x H)\n\nFoldable",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZDM2NDA4NDgzMDRiZDBjMzgwMjY0MTk3ZDU5ZjA0MmE0ZmE0ZTU1NzUyNjIxZGE0Y2M4ZDYxYmFhNDIwMDRhMC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=266d228f7f0e6be89b2ac7ecd590e9a7281056364c0ec94b4e542e8b92140835"
    ],
    "url": "https://www.adverts.ie/wardrobes/4-panel-room-divider-anthracite-346x180-cm-fabric/37412975"
  },
  {
    "title": "Livestock Feeding Trough 22 Gallon Capacity 45\" Goat Feeder for 10 Sheep",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nDurable & Long Lasting: Made from high quality galvanized steel material, the livestock feeder features high-strength ensuring durability. The horse hay feeder is rust-resistant, suitable for outdoor use.\n\nEfficient Feeding: With a large capacity design of 22 gallons, this goat feeder can easily meet the daily needs of 10 goats, reducing the hassle of frequent refilling and improving feeding efficiency.\n\nUnique Design: This goat feeder comes with rounded edges and corner design, making it secure for goat from injuries. It is suitable for young animals. Smooth surface is easy to rinse and keep it clean.\n\nConvenient to Move: Our livestock feeding trough is lightweight and easy to move that makes it easy to adapt to frequent adjustments.\n\nFlexible and Versatile: Livestock trough is suitable for sheep farms, horse farms, farms and yards to meet various feeding needs.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMjY5MDNkM2U0MTFhNDNkZDEyMGI4MTcyNDg0OWQwNWQ2ZTZiMGM0ODE1YjI5OTY3ZDA2MmVlMjY4NzNlOTM2MC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=245c741408b8e7bf54eef5d1c39c7459e3c0487c293f65af4f87d67407783ed7"
    ],
    "url": "https://www.adverts.ie/farm-machinery/livestock-feeding-trough-22-gallon-capacity-45-goat-feeder-for-10-sheep/37412920"
  },
  {
    "title": "Freestanding Storage Cabinet w/ Wood Legs 5 Compartments Cupboard Home Office Organisation Stylish Bedroom Hallway Furniture 60L x 30W x 121H cm - Whi",
    "price": "€300",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nFeatures three big compartments, two small and one cupboard for plenty of storage\nGroove handle on cabinet for easy opening\nParticle board frame is durable for reliable everyday use\nAnti-tipping design for safety around children and pets\nFour wood legs for a stable base, elevates to circulate air and prevent moisture build-up\nIdeal for bedrooms, hallways, offices\nMaximum weight 60kg, assembly required\nSpecification:\nBrand: HOMCOM\nColour: White and brown\nMaterials: Particle board\nDimensions: 121H x 60W x 30Dcm\nBig compartment: 33H x 32W x 27.5Dcm\nSmall compartment: 16H x 23.5W x 27.5Dcm\nCabinet inner: 67.5H x 24W x 27.5Dcm\nLegs: 15.5Hcm\nWeight capacity: Whole: 40kg. Single compartment: 3kg\nFlat pack: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNTdjOWEwOTI2ZWQ0MDRiMmYwY2Q0MDYxNjUzNjlmNmFhNzJiMzk4MGI1NzBmNzg4MGJlZjMzOGNmNWQ0ZjRjNC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=8f2d6dfe5f21da998b08fc6e2cbd68e59bc5be8e159e0d76ab1f144dcc03c468"
    ],
    "url": "https://www.adverts.ie/armchairs/freestanding-storage-cabinet-w-wood-legs-5-compartments-cupboard-home-office-organisation-stylish-bedroom-hallway-furniture-60l-x-30w-x-121h-cm-whi/37412893"
  },
  {
    "title": "Adjustable Swivel Bar Stools Set of 2, Barstools with Footrest and Backrest, Steel Frame Gas Lift, for Kitchen Counter Dining Room, Brown",
    "price": "€350",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nCurved moulded seat to support the body, with curved back panel and padding for comfort and support\n89.5-109.5cm adjustable height to match different tables and worktops\nSwivelling seat motion to move from side to side freely\nPowder-coated steel frame is strong and supportive, with a bottom bar to rest legs and feet\nFaux leather upholstery is sleek and beautiful\nLarge base to promote balance, and with non-skid rubber pads\nMaximum load 120kg, assembly required\nSpecification:\nColour: Brown, Black\nMaterial: PU, Steel, Foam\nOverall Dimensions: 45.5W x 46D x 89.5-109.5H cm\nSeat Dimension: 45.5W x 32D x 62-82H cm\nFootrest Dimension: 28W x 17D x 20-40H cm\nCushion Thickness: 6cm (seat)\nBase Dimension: Φ38cm\nWeight Capacity: 120kg",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZDYzOGFlZmI3ZWU3MWFjMTRjYWNlYjg4MTM2Y2EwMmU1NTYzZWE5ZTg5ZGYyNzg5OThiOWY0YTdlM2U0YzdkYy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=c6840a7a9edb46d823a6427efde4a059825bae7e17e337d6858a0ebf8c51dd62"
    ],
    "url": "https://www.adverts.ie/other-furniture/adjustable-swivel-bar-stools-set-of-2-barstools-with-footrest-and-backrest-steel-frame-gas-lift-for-kitchen-counter-dining-room-brown/37412877"
  },
  {
    "title": "Cash Register Drawer, 16\" 12 V, for POS System with 5 Bill 8 Coin Cash Tray, Removable Coin",
    "price": "€150",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nHeavy Duty Construction: Measures 16.1\" x 16.5\" x 4\"/ 41 x 42 x 10 cm in total. This cash register drawer consists of heavy-duty SPCC steel boards, wearproof steel clips, and sturdy ABS trays. It is ideal for small businesses, like supermarkets and restaurants.\n\n5 Bill 8 Coin Compartments: Our square cash drawer features removable 5 bill trays, 8 coin trays, and 1 cheque slot for inserting large bills, cheques, and receipts without opening the drawer. It is compatible with multiple currencies.\n\n3 Ways to Open: The cash drawer under the counter will open by connecting with the receipt printer. Also, it can be opened with a key or emergency lever. You can open the drawer in seconds. With 3 secure ways to open this drawer, you will be prepared for any situation.\n\nHigh Compatibility: Our cash drawer is equipped with RJ11/RJ12 cable to support most receipt printers such as Epson, MUNBYN, Star Micronics, Rongta, and BestXin Yin.\n\nWide Application: The cash drawer for small businesses keeps and organizes bills, cheques, or coins orderly and securely. It is efficient to protect your business from loss and perfect for groceries, banks, offices, coffee shops, supermarkets, bars, etc.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMzg4ZDU4NDY3NDBmYzIyZWRhNmQ0YzU4MDg0ZjU1ZjA4OGI2OGM5ZTZmOTI3ZTA2YTYzZjdkNjcwZDAzYTY5OC5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=3e1f3a41674a738a600de1147544188cbe5fca513b1909c410b2bdaf20d498b7"
    ],
    "url": "https://www.adverts.ie/other-fixtures-fittings/cash-register-drawer-16-12-v-for-pos-system-with-5-bill-8-coin-cash-tray-removable-coin/37412831"
  },
  {
    "title": "Console Table Modern Sofa Side Desk with Storage Shelves Drawers for Living Room Entryway Bedroom Ivory White",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nMade of painted MDF and solid pine, the console table is sturdy and durable, built to last for years to come\nThe table supports weights up to 100 kg\nWide table top, 2 drawers and a lower shelf offer spacious storage\nThe simple yet stylish design with clean curved lines makes the ivory white table look elegant in any decor\nSimple construction ensures easy assembly\nEco-friendly smooth surface makes it easy to clean with damp cloth\nIdeal for kitchens, dining rooms, living rooms, hallways and more\nSpecification:\nItem Name: Console Table\nBrand Name: HOMCOM\nMaterial Used: MDF, Pine\nColour: Ivory White\nProduct Dimension: 100L x 33W x 76H cm\nTop Board Thickness: 1.5 cm\nDrawer Interior Size: 35.2W x 24D x 7H cm\nShelf Size: 95L x 28W x 1.5T cm\nBox Dimension: 114.5L x 22.1W x 39.5H cm\nGross Weight: 16.17 kg\nNet Weight: 13.82 kg\nOverall Weight Capacity: 100 kg\nPer Drawer Weight Capacity: 25 kg\nShelf Weight Capacity: 15kg\nFlat Pack: Yes\nAssembly Required: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMGRiODBmMWYyMjQzNzVkN2FmYzY5MTIwYjBmMjdlM2VhZmRhNTllNzgwZWQwZWIzMDMyODc3MmYwMTQ4Y2EzNS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=7cc112730e1e3da787a1beeaf5444f9a9108571d1f4251c5fb8d85e6f22c1d56"
    ],
    "url": "https://www.adverts.ie/other-home-garden/console-table-modern-sofa-side-desk-with-storage-shelves-drawers-for-living-room-entryway-bedroom-ivory-white/37412821"
  },
  {
    "title": "2 Bar Stools Modern Upholstered Seat Bar Chairs w/ Metal Frame, Solid Wood Legs Living Room",
    "price": "€350",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nSet of two elegant and softly curved chairs which look anywhere in your home\nSolid wooden legs for support as you sit - tall length to matching higher spots\nDeep and wide cushioned seat for comfort, combined with a high back and armrests for support\nStylish linen upholstery, allows the skin to breathe naturally\nMaximum load 120kg, assembly required\nSpecification:\nColor: Beige\nMaterial: Linen Fabric, Sponge, Beech, Metal\nWeight Capacity: 120kg\nOverall Dimension: 55W x 48D x 100H cm\nSeat Dimension: 39W x 37D cm\nSeat Height from Ground: 80cm\nSeat Cushion Thickness: 6cm",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiMTcwMjQ0MzRjNWY2ODdmYmJlODAzODMzYmJlZDVmMDIxYWRmYjJkYjAxOTUzMmI1NzMzMDMxODZhOGUyNGNmYi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=80a15bf589993f2d9128f80414c611f0b2eed29398f408a9fa95b8bc2ebc2dfd"
    ],
    "url": "https://www.adverts.ie/other-business-office/2-bar-stools-modern-upholstered-seat-bar-chairs-w-metal-frame-solid-wood-legs-living-room/37412793"
  },
  {
    "title": "30L 60-230C Mini Electric Oven, with Accessories - Silver Tone",
    "price": "€275",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\n30L capacity holds approx. 8x bread slices/12x chicken wings. Large enough for meal for one\nCompact and portable design is great for small spaces\n60-230℃ adjustable temperature and 60 minute timer. Cook how you require\nThree heat directions: upper, lower or together\nAll parts are dishwasher safe for through cleaning\nFour rack positions with wire rack and baking pan\nDouble-layer glass door and a tray handle for safety\nSpecification:\nColour: Silver\nMaterial: Steel, Stainless Steel, Enamel, Tempered Glass\nOverall Dimensions: 48.6W x 37D x 32Hcm\nInner Dimension: 33.8W x 31D x 26.3Hcm\nCable Length: 0.85m\nDoor Information: 35.8W x 25Hcm (size), 90° (opening angle)\nAccessory Size: 34W x 28.9Dcm (baking pan), 34W x 29Dcm (oven rack)\nVoltage Size: AC 230V 50Hz, 4.7A\nPower: 1600W",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiODJmZmZjMTVmYzJiYTBmMjVmZWZhYWI0ODAwYzY5ZWY0MzYwYjZkMDIzMDFhMTZmMjNlYjYxZjRkYmQxYmFiNy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=3c74feba4b91443c59c733a1b6c60233553e5cead1c8622e08f2164071adcf5d"
    ],
    "url": "https://www.adverts.ie/ovens/30l-60-230c-mini-electric-oven-with-accessories-silver-tone/37412781"
  },
  {
    "title": "Steam Cleaner Multipurpose Steamer with 27 Accessories for Home Cleaning",
    "price": "€285",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\n5-Minute Quick Heat-Up: With our intelligent atomization system and 2000W power, this steam cleaner heats up in 5-8 minutes. You can easily adjust the steam flow to clean tiles, marble, wood floors, carpets, and glass. Note: Power may vary by region.\n\nPowerful Steam Cleaning: This multipurpose steam cleaner uses 212 °F steam to clean profoundly and dissolve 99% of grease and stains. It features dry burn prevention, power cut security, and auto-reset for security.\n\n27 Accessories Included: Our grout steam cleaner comes with a floor brush, a big nozzle, a glass brush, an ironing brush, two stainless brushes, four nylon brushes, two mop pads, three ironing towels, a wiper, a hose and wallpaper stripper, a measuring cup, a funnel, an accessory bag, and two gloves to tackle every cleaning task. Note: A small amount of water spray is normal during use.\n\n53 oz Large Water Tank: This household steam cleaner has a 53 oz / 1.5 L large water tank that provides 35-116 minutes of continuous steam cleaning. The user-friendly indicator light shows red when heating and green when ready. Note: The duration is for reference only and may vary depending on the actual usage setting.\n\nLarger Coverage Area: With an extra-long 4.9 ft / 1.5 m steam hose and 16.4 ft / 5 m power cord, this car detailing steamer offers excellent maneuverability and reach for hard-to-access areas. The low center-of-gravity design, portable handle, and swivel wheels ensure effortless movement and stability during cleaning.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiOGQxMjhlZTRhMzMyNTQwZGEzOGM1M2I0MTc5NjNjNTM2NTIxMmNiM2Q4MDg2NWY4NzBiMTBiMTZmNWI5MGU3ZS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=41e67f0a19ff5a0953e03abe6b8b077dfccf1ce687b6407e52b80f66d6cdea4a"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/steam-cleaner-multipurpose-steamer-with-27-accessories-for-home-cleaning/37412766"
  },
  {
    "title": "Coin Counter Professional Coin Sorter LED Display Holds up to 11000 Coins",
    "price": "€685",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nEfficient Sorting: The newly upgraded sorting technology significantly improves work efficiency, allowing the machine to sort and process up to 1300 coins per minute. Say goodbye to the tedious task of manually counting coins, and increase your work efficiency.\n\nLarge Capacity Design: You can rely on our coin sorter to handle the tedious coin counting tasks. With its large capacity design, it can hold up to 11,000 coins, greatly reducing the need for frequent emptying. This feature makes your work more efficient and convenient.\n\nSimple Operation: Our coin sorter adopts a simple design. Just set the coin diameter and thickness, and you can start sorting quickly. This easy setup allows you to effortlessly begin the sorting process, and makes it easier to count and manage coins.\n\nEasy Packaging: Simply attach the coin chute or fabric bag to the coin output area, and it will fill up effortlessly. This design allows for quick packaging and storage of large quantities of coins, saving you valuable time and effort.\n\nMulti-Scenario Application: Whether you're at the cashier or in the office, our coin sorter meets your needs with high-speed sorting, large capacity storage, and simple operation. It provides convenience and efficiency to your work environment",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYzI2OTBjYjNlNzA3MWJiNDdiY2U2ZGMyM2UxNmQwYTdmNjJhNjdmZGNkNmJiNzYzZjFlNjNjNDg5ODc3Y2M1Yi5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=4216012c380010a492ed801b932e788d54684216eb1d50305f7f61e7f719c5da"
    ],
    "url": "https://www.adverts.ie/heavy-machinery/coin-counter-professional-coin-sorter-led-display-holds-up-to-11000-coins/37412638"
  },
  {
    "title": "9 x 6FT Foundation Ventilation Steel Outdoor Garden Shed Grey",
    "price": "€650",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\n\nFeatures:\n\n9.3m³ sizing is spacious enough for storing all your outdoor tools, equipment and gardening gear\n\nMade from galvanised steels with a weathered top coat for durability and protection against the outdoor elements\n\nSliding double doors for easy access\n\nSlopped roof for the water to roll to floor, preventing build up and rust formation\n\nFour ventilation holes provides aeration inside, preventing mould and mildew build up\n\nFloor foundation included, with all parts pre-cut and pre-drilled\n\nplease use gloves when installing\n\nAssembly required\n\nSpecification:\n\nItem Name: Garden Shed Storage\n\nBrand Name: Outsunny\n\nMaterial: Colour plate, polypropylene\n\nColour: Grey\n\nNet Weight: 65kg\n\nOverall Dimension: 277L x 191W x 192H (cm)\n\nRoom Interior Dimension: 267L x 181W x 192H (cm)\n\nDoor / Wall Height: 152cm\n\nDoor Size: 96L x 152H (cm)\n\nWindow Size: 21.8L x 9.8W (cm)\n\nColour Plate Thickness: 0.025cm\n\nPlease Note: Tools in the shed are not included.\n\nFlat Pack: Yes",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiM2Q4YjE1NGM5MGRlZTUzNTU5N2QzZjRjYmQyZmIwNTVlZmFjYzFiYWFiNWM1NzkzMDBiOGIyMWE2NzcyYWEwMy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=29111f9ae239ca5f7c7ce10ad4f2af80a05fcbc5a5894a36b8bd647bc243105e"
    ],
    "url": "https://www.adverts.ie/electric/9-x-6ft-foundation-ventilation-steel-outdoor-garden-shed-grey/37335545"
  },
  {
    "title": "60'' X 5.9\" Forklift Pallet Fork Extensions Pair Lift Truck Industrial Retaining ( All Size Available )",
    "price": "€390",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nAbout This Item\nRock-Solid Steel Build: Our pallet fork extensions are crafted from top-quality Q235 carbon steel, boasting an impressive load capacity of up to 4000 lbs/1.815 tons. No bending or breaking under heavy loads, ensuring long-lasting performance. Perfect for tackling tough tasks!\nFine Craftsmanship: These forklift extensions feature seamless one-piece welding for enhanced structural stability and durability. Plus, they're coated with a sleek powder finish to fight off rust. Work in any environment without worry, even in humid or corrosive workplaces.\nUniversal Size: With universal dimensions of 59.84\"/1520 mm in total length, 5.91\"/150 mm in outer width, 1.97\"/50 mm in outer height, and 5.51\"/140 mm in inner width, these forklift fork extensions snugly fit 5\" wide forks. It's like they were made for each other!\nEffortless Setup: Designed for a tool-free installation, our fork extensions can be easily mounted on the forks. Considering the fast-paced work environment, they are designed to ensure a quick and convenient installation process. You'll have them on your forks in under a minute. Get back to work quicker and easier!\nVersatile for Any Job: Whether you're in a warehouse, at a construction site, or on a farm, our forklift pallet fork extensions have got you covered. They handle big and heavy loads with ease, supercharging your work efficiency and cargo handling capacity. Work smarter, not harder",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYzQwM2JjMjY5MjY5ODRlM2I3MGZjMTU0MTg5YTlkNmYwNTMwZWIxMjk2MTlkNmM5NDI0MGZkMWRhMzY3NWIyNy5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=9e0f91676cc7dc261251537a4479a016e93c6099330dd54edecc29de4b563738"
    ],
    "url": "https://www.adverts.ie/plant-machinery/60-x-5-9-forklift-pallet-fork-extensions-pair-lift-truck-industrial-retaining-all-size-available/32789869"
  },
  {
    "title": "Bottle Water Dispenser Pump System Water Dispensing System 6m 220V AC UK Plug with Double Inlets Compatible Use with Coffee/Tea Machines, Water Dispensers, Ice Makers, Refrigerators",
    "price": "€250",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nMaterial\n\nPlastic\n\nCapacity\n\n5 gallons\n\nBrand\n\nYUEWO\n\nStyle\n\nBottom Load\n\nWeight\n\n3.2 Kilograms\n\nWattage\n\n1.1E+2\n\nWater Dispenser Pump System-This 220V water dispenser pump works with two commercial jugs of water. It can deliver water under pressure to an individual drinking water faucet, offer hot(under 60 degrees Celsius) or chilled water anytime. Perfect for water inlet of a refrigerator, coffee & Tea machine and anywhere else on-demand water supply is needed.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiZjE1Njk5M2U4MmJkZTYyMTI1MjczM2I5ZmZhM2VlNTYxYTIyMTIwMDAxNzI1ZWQ3NGViOWIzYTE5ZjNmYWIyMS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjozNTAsImhlaWdodCI6MjczfX19?signature=13d767797fd8cf0bbb26f6e46c889c4d778321111e06f64a379fab60fe9f71c6"
    ],
    "url": "https://www.adverts.ie/other-home-garden/bottle-water-dispenser-pump-system-water-dispensing-system-6m-220v-ac-uk-plug-with-double-inlets-compatible-use-with-coffee-tea-machines-water-dispensers-ice-makers-refrigerators/37404292"
  },
  {
    "title": "Garden Wooden Storage Container Box Multipurpose Outdoor Patio Furniture w/ Chains for Outdoor Garden Tools and Pool Toys, White",
    "price": "€350",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures:\nWith a large and free space to place most tools and accessories\nConstructed of solid fir wood with water-resistant paint for durable use\nBottom gap design supply ventilation and prevent rainwater accumulation\nTwo chains can fix the top\nAll feet have anti-skid pads\nCan used as a garden workbench or just a rest sit\nAssemble is required\nSpecification:\nColor: White\nMaterial: Fir Wood\nOverall Dimension: 127L x 56W x 60H cm\nInner Size: 119L x 48W x 49.6H cm\nWeight Capacity: 170kgs",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiYmJjNWY5MDVkODBkODY4YTFhMjI1YjM2YTU1ZjRkNTk0NTk5NTk3ZmNlZDE3YjQwNGI3MWRmOWU2NzkxZmIzYS5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=b4b7212c7506c54ce17cf4c0261214257fc70ebf253593de99e2b86c8629dbfd"
    ],
    "url": "https://www.adverts.ie/cabinets/garden-wooden-storage-container-box-multipurpose-outdoor-patio-furniture-w-chains-for-outdoor-garden-tools-and-pool-toys-white/37404288"
  },
  {
    "title": "Lawn Mower Tires with Rim, 11x4-7\" Tubeless Tractor Tires, 2-Pack Tire and Wheel Assemby, Flat-free PU Tire, 3.4\" Centered Hub, 3/4\" Bushing Size",
    "price": "€175",
    "description": "Condition: New\n\n\nPlease read the description\nPayment via Revolut/ PayPal/ Ireland Bank Transfer\nBrand New!  available for delivery only\nNo collection\nNo Cash on delivery\ndelivery nationwide ireland:\nDelivery Time period 4_6\ndays\n\nDelivery charges 15€.\nFeatures & Details\n\nLawn Mover Tires Size: Tire diameter:11\"; Tire width: 4\"; Rim diameter: 7\". Our lawn mower tires are crafted to fit most lawn mowers and lawn tractor models, ensuring a perfect match.\n\nAccurate Fitting: Through accurate measurement, the bushing size is 3.4\" and the hub depth is 3.4\". To ensure that the size of the tire to be purchased is correct, please refer to the size of the original tire on the vehicle before purchase and accurately match the above size to be compatible.\n\n350 LBS Load Capacity: Lawn tractor rims are made of rugged steel with a load capacity of up to 350 lbs(per wheel), providing you with a more stable and safe experience.\n\nFlat-free PU Tires: Crafted from PU material, our lawn mower tires are flat-free, wear resistance, and puncture protection. Low maintenance saves you time and labor. Ready to use without worries.\n\nComprehensive Adapter Kit: Our riding lawn mower tire kit includes 20 additional fittings, such as various sleeves and gaskets, significantly broadening the scope of equipment compatibility.",
    "images": [
      "https://media.adverts.ie/eyJidWNrZXQiOiJtZWRpYS5hZHNpbWcuY29tIiwia2V5IjoiNjY2YTlkNzBjZGQxN2FlNTYwZjhiZTIzNDU0YzZhNDY4MTVlMGM0OTBhNjQyNDI3MjU1ZDgzYmNlNGQ3MDg5My5qcGciLCJvdXRwdXRGb3JtYXQiOiJqcGVnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyOTIsImhlaWdodCI6MjkyfX19?signature=984aaa58a39270e3e7eb6975a203d36c7b2bc03d251860d93310289b1b496cf4"
    ],
    "url": "https://www.adverts.ie/other-diy-renovation/lawn-mower-tires-with-rim-11x4-7-tubeless-tractor-tires-2-pack-tire-and-wheel-assemby-flat-free-pu-tire-3-4-centered-hub-3-4-bushing-size/37404248"
  }
]